
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: ShooterGame

#pragma pack(push, 0x1)

/// Class /Game/InputActions/ActionTraits/ProjectileFollowActionTraits.ProjectileFollowActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UProjectileFollowActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/CountdownPingActionTraits.CountdownPingActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UCountdownPingActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/OutlinesAllActionTraits.OutlinesAllActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UOutlinesAllActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/MoveRightActionTraits.MoveRightActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UMoveRightActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/OpenAESWheelActionTraits.OpenAESWheelActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UOpenAESWheelActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ObservePlayer5ActionTraits.ObservePlayer5ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UObservePlayer5ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/TouchMoveDownActionTraits.TouchMoveDownActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UTouchMoveDownActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/PartyPTTActionTraits.PartyPTTActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UPartyPTTActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/PartyClutchMuteActionTraits.PartyClutchMuteActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UPartyClutchMuteActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ObservePlayer3ActionTraits.ObservePlayer3ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UObservePlayer3ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/TargetActionTraits.TargetActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UTargetActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/VOEmoteCommendActionTraits.VOEmoteCommendActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UVOEmoteCommendActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/PrevWeaponActionTraits.PrevWeaponActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UPrevWeaponActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/CommMenuOption1ActionTraits.CommMenuOption1ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UCommMenuOption1ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/LeaveChatActionTraits.LeaveChatActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class ULeaveChatActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/OutlinesEnemyActionTraits.OutlinesEnemyActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UOutlinesEnemyActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/CautionPingActionTraits.CautionPingActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UCautionPingActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/CommWheelIndexActionTraits.CommWheelIndexActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UCommWheelIndexActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ToggleMinimapActionTraits.ToggleMinimapActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UToggleMinimapActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ToggleMissionSettingsActionTraits.ToggleMissionSettingsActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UToggleMissionSettingsActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/OnMywayPingActionTraits.OnMywayPingActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UOnMywayPingActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/OpenCommTree1ActionTraits.OpenCommTree1ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UOpenCommTree1ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/CommMenuOption4ActionTraits.CommMenuOption4ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UCommMenuOption4ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/JanusSpdDownActionTraits.JanusSpdDownActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UJanusSpdDownActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/OpenCommTree4ActionTraits.OpenCommTree4ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UOpenCommTree4ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/GamepadDropItemsHoldActionTraits.GamepadDropItemsHoldActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UGamepadDropItemsHoldActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ToggleJanusUIActionTraits.ToggleJanusUIActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UToggleJanusUIActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/VoteOption3ActionTraits.VoteOption3ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UVoteOption3ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/StrategyTacticsCommWheelActionTraits.StrategyTacticsCommWheelActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UStrategyTacticsCommWheelActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ToggleJanusProgressActionTraits.ToggleJanusProgressActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UToggleJanusProgressActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/UseChannelObjectActionTraits.UseChannelObjectActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UUseChannelObjectActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/SocialCommWheelActionTraits.SocialCommWheelActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class USocialCommWheelActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/OutlinesNoneActionTraits.OutlinesNoneActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UOutlinesNoneActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/JanusSpdUpActionTraits.JanusSpdUpActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UJanusSpdUpActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ObservePlayer1ActionTraits.ObservePlayer1ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UObservePlayer1ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/NextWeaponActionTraits.NextWeaponActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UNextWeaponActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/VoteOption1ActionTraits.VoteOption1ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UVoteOption1ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/CommMenuOption0ActionTraits.CommMenuOption0ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UCommMenuOption0ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/TeamClutchMuteActionTraits.TeamClutchMuteActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UTeamClutchMuteActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/SecondHalfUltAlternateActionTraits.SecondHalfUltAlternateActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class USecondHalfUltAlternateActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ClientNavUpActionTraits.ClientNavUpActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UClientNavUpActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/VOEmoteJokeActionTraits.VOEmoteJokeActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UVOEmoteJokeActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/VoteOption0ActionTraits.VoteOption0ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UVoteOption0ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/CommMenuOption9ActionTraits.CommMenuOption9ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UCommMenuOption9ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/FocusCombatReportActionTraits.FocusCombatReportActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UFocusCombatReportActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/VOEmoteNoActionTraits.VOEmoteNoActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UVOEmoteNoActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/FirstHalfUltAlternateActionTraits.FirstHalfUltAlternateActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UFirstHalfUltAlternateActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/WhisperChatActionTraits.WhisperChatActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UWhisperChatActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ObserverFollowPrevActionTraits.ObserverFollowPrevActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UObserverFollowPrevActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ToggleCharacterAbilityHUDActionTraits.ToggleCharacterAbilityHUDActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UToggleCharacterAbilityHUDActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/SecondHalfHalfUltInputActionTraits.SecondHalfHalfUltInputActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class USecondHalfHalfUltInputActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/GamepadWeaponSwapTapActionTraits.GamepadWeaponSwapTapActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UGamepadWeaponSwapTapActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/GamepadPrimaryTriggerAxisActionTraits.GamepadPrimaryTriggerAxisActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UGamepadPrimaryTriggerAxisActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ShowExtendedInfoActionTraits.ShowExtendedInfoActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UShowExtendedInfoActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ToggleGamepadNavigationActionTraits.ToggleGamepadNavigationActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UToggleGamepadNavigationActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ToggleMouseCursorActionTraits.ToggleMouseCursorActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UToggleMouseCursorActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ModeToggleActionTraits.ModeToggleActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UModeToggleActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/OpenMegamapActionTraits.OpenMegamapActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UOpenMegamapActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/OpenCommTree3ActionTraits.OpenCommTree3ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UOpenCommTree3ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/Activate_MeleeActionTraits.Activate_MeleeActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UActivate_MeleeActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ClientNavDownActionTraits.ClientNavDownActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UClientNavDownActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/UseAscenderObjectActionTraits.UseAscenderObjectActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UUseAscenderObjectActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ObservePlayer9ActionTraits.ObservePlayer9ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UObservePlayer9ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/OpenCommTree2ActionTraits.OpenCommTree2ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UOpenCommTree2ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/NeedSupportPingActionTraits.NeedSupportPingActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UNeedSupportPingActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ObservePlayer2ActionTraits.ObservePlayer2ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UObservePlayer2ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ObservePlayer4ActionTraits.ObservePlayer4ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UObservePlayer4ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ObservePlayer7ActionTraits.ObservePlayer7ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UObservePlayer7ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ToggleSightLinesActionTraits.ToggleSightLinesActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UToggleSightLinesActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/DumpLiveDiagnosticsActionTraits.DumpLiveDiagnosticsActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UDumpLiveDiagnosticsActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/VOEmoteYesActionTraits.VOEmoteYesActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UVOEmoteYesActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/TeamChatActionTraits.TeamChatActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UTeamChatActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/MoveForwardActionTraits.MoveForwardActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UMoveForwardActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/CommMenuOption6ActionTraits.CommMenuOption6ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UCommMenuOption6ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/LookLeftAndRight.LookLeftAndRight_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class ULookLeftAndRight_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/GamepadSecondaryTriggerAxisActionTraits.GamepadSecondaryTriggerAxisActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UGamepadSecondaryTriggerAxisActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/WatchingHerePingActionTraits.WatchingHerePingActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UWatchingHerePingActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/Activate_PrimaryActionTraits.Activate_PrimaryActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UActivate_PrimaryActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ObserverCycleCinematicCamsActionTraits.ObserverCycleCinematicCamsActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UObserverCycleCinematicCamsActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/GhostActionTraits.GhostActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UGhostActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/Activate_SecondaryActionTraits.Activate_SecondaryActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UActivate_SecondaryActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/GamepadShiftActionTraits.GamepadShiftActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UGamepadShiftActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/OpenCommMenuActionTraits.OpenCommMenuActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UOpenCommMenuActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ProtoAlternateFireActionTraits.ProtoAlternateFireActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UProtoAlternateFireActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/VOEmotePingActionTraits.VOEmotePingActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UVOEmotePingActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/LookUpAndDown.LookUpAndDown_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class ULookUpAndDown_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/PingActionTraits.PingActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UPingActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/CommMenuOption5ActionTraits.CommMenuOption5ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UCommMenuOption5ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/CommMenuOption8ActionTraits.CommMenuOption8ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UCommMenuOption8ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ObservePlayer6ActionTraits.ObservePlayer6ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UObservePlayer6ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/VOEmoteThanksActionTraits.VOEmoteThanksActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UVOEmoteThanksActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/InformationalHUDActionTraits.InformationalHUDActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UInformationalHUDActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/EquipLastUsedActionTraits.EquipLastUsedActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UEquipLastUsedActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/WheelNavigationActionTraits.WheelNavigationActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UWheelNavigationActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/GamepadDropItemsTapActionTraits.GamepadDropItemsTapActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UGamepadDropItemsTapActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/CharacterSelectActionTraits.CharacterSelectActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UCharacterSelectActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/UncrouchActionTraits.UncrouchActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UUncrouchActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ExpandMinimapActionTraits.ExpandMinimapActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UExpandMinimapActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/VOEmoteHelpActionTraits.VOEmoteHelpActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UVOEmoteHelpActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/VOEmoteTauntActionTraits.VOEmoteTauntActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UVOEmoteTauntActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/DeveloperMenuActionTraits.DeveloperMenuActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UDeveloperMenuActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/VoteOption2ActionTraits.VoteOption2ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UVoteOption2ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ObserverMoveUpActionTraits.ObserverMoveUpActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UObserverMoveUpActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/VOEmoteLaughActionTraits.VOEmoteLaughActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UVOEmoteLaughActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/UseGenericMapObjectActionTraits.UseGenericMapObjectActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UUseGenericMapObjectActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ClientNavRightActionTraits.ClientNavRightActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UClientNavRightActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/VoteOpenActionTraits.VoteOpenActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UVoteOpenActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/TogglePlayerLoadoutVisibilityActionTraits.TogglePlayerLoadoutVisibilityActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UTogglePlayerLoadoutVisibilityActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ModifyObservePlayerActionTraits.ModifyObservePlayerActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UModifyObservePlayerActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ObservePlayer8ActionTraits.ObservePlayer8ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UObservePlayer8ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/UseAlternateObjectActionTraits.UseAlternateObjectActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UUseAlternateObjectActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/CommMenuOption2ActionTraits.CommMenuOption2ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UCommMenuOption2ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ClientNavLeftActionTraits.ClientNavLeftActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UClientNavLeftActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ObservePlayer10ActionTraits.ObservePlayer10ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UObservePlayer10ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/AlternateMoveUpActionTraits.AlternateMoveUpActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UAlternateMoveUpActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ToggleMapActionTraits.ToggleMapActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UToggleMapActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/VOEmoteSorryActionTraits.VOEmoteSorryActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UVOEmoteSorryActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/CommMenuOption3ActionTraits.CommMenuOption3ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UCommMenuOption3ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/TouchMoveUpActionTraits.TouchMoveUpActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UTouchMoveUpActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/CommMenuOption7ActionTraits.CommMenuOption7ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UCommMenuOption7ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/AllChatActionTraits.AllChatActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UAllChatActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/MoveUpActionTraits.MoveUpActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UMoveUpActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ToggleShopActionTraits.ToggleShopActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UToggleShopActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ExpandedCombatCommWheelActionTraits.ExpandedCombatCommWheelActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UExpandedCombatCommWheelActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/OutlinesFriendlyActionTraits.OutlinesFriendlyActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UOutlinesFriendlyActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ToggleFreeCamActionTraits.ToggleFreeCamActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UToggleFreeCamActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ToggleReplayUIActionTrait.ToggleReplayUIActionTrait_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UToggleReplayUIActionTrait_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ReplaySkipRoundForwardActionTrait.ReplaySkipRoundForwardActionTrait_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UReplaySkipRoundForwardActionTrait_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/SecondaryTriggerDownActionTraits.SecondaryTriggerDownActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class USecondaryTriggerDownActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ReplayTogglePlaybackActionTraits.ReplayTogglePlaybackActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UReplayTogglePlaybackActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ReplaySkipTimeBackwardActionTrait.ReplaySkipTimeBackwardActionTrait_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UReplaySkipTimeBackwardActionTrait_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/PrimaryTriggerDownActionTraits.PrimaryTriggerDownActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UPrimaryTriggerDownActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ObserverFollowNextActionTraits.ObserverFollowNextActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UObserverFollowNextActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/GamepadWeaponSwapHoldActionTraits.GamepadWeaponSwapHoldActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UGamepadWeaponSwapHoldActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/InspectActionTraits.InspectActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UInspectActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/Activate_LevelActionTraits.Activate_LevelActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UActivate_LevelActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/GamepadMapCommActionTraits.GamepadMapCommActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UGamepadMapCommActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/SprayActionTraits.SprayActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class USprayActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/Activate_Ability1ActionTraits.Activate_Ability1ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UActivate_Ability1ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ShowScoreboardActionTraits.ShowScoreboardActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UShowScoreboardActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/GamepadWeaponSwapPressActionTraits.GamepadWeaponSwapPressActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UGamepadWeaponSwapPressActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/UseObjectActionTraits.UseObjectActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UUseObjectActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/Activate_Ability2ActionTraits.Activate_Ability2ActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UActivate_Ability2ActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/GamepadSprayCommWheelActionTraits.GamepadSprayCommWheelActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UGamepadSprayCommWheelActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/InGameMenuActionTraits.InGameMenuActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UInGameMenuActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/CommWheelActionTraits.CommWheelActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UCommWheelActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ToggleZoomLevelActionTraits.ToggleZoomLevelActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UToggleZoomLevelActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/WalkActionTraits.WalkActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UWalkActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/TapWeaponSwapMelee.TapWeaponSwapMelee_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UTapWeaponSwapMelee_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/CrouchActionTraits.CrouchActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UCrouchActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/Activate_UltimateActionTraits.Activate_UltimateActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UActivate_UltimateActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/DropEquippableActionTraits.DropEquippableActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UDropEquippableActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/Activate_GrenadeAbilityActionTraits.Activate_GrenadeAbilityActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UActivate_GrenadeAbilityActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/PrimaryTriggerActionTraits.PrimaryTriggerActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UPrimaryTriggerActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/FirstHalfUltInputActionTraits.FirstHalfUltInputActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UFirstHalfUltInputActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/SecondaryTriggerActionTraits.SecondaryTriggerActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class USecondaryTriggerActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/TeamPTTActionTraits.TeamPTTActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UTeamPTTActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/UseAgentAbilityObjectActionTraits.UseAgentAbilityObjectActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UUseAgentAbilityObjectActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ReloadActionTraits.ReloadActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UReloadActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/JumpActionTraits.JumpActionTraits_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UJumpActionTraits_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/TapWeaponSwapSecondary.TapWeaponSwapSecondary_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UTapWeaponSwapSecondary_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ReplayFreeCamLookActionTrait.ReplayFreeCamLookActionTrait_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UReplayFreeCamLookActionTrait_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ReplaySkipRoundBackwardActionTrait.ReplaySkipRoundBackwardActionTrait_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UReplaySkipRoundBackwardActionTrait_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ReplayUIVisibilityWheelActionTrait.ReplayUIVisibilityWheelActionTrait_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UReplayUIVisibilityWheelActionTrait_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ReplaySkipTimeForwardActionTrait.ReplaySkipTimeForwardActionTrait_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UReplaySkipTimeForwardActionTrait_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraits/ReplayFreeCamMoveActionTrait.ReplayFreeCamMoveActionTrait_C
/// Size: 0x00E0 (224 bytes) (0x0000E0 - 0x0000E0) align 8 MaxSize: 0x00E0
class UReplayFreeCamMoveActionTrait_C : public UActionTraits
{ 
public:
};

/// Class /Game/InputActions/ActionTraitsManager.ActionTraitsManager_C
/// Size: 0x0090 (144 bytes) (0x000090 - 0x000090) align 8 MaxSize: 0x0090
class UActionTraitsManager_C : public UActionTraitsManager
{ 
public:
};

#pragma pack(pop)


static_assert(sizeof(UProjectileFollowActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UCountdownPingActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UOutlinesAllActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UMoveRightActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UOpenAESWheelActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UObservePlayer5ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UTouchMoveDownActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UPartyPTTActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UPartyClutchMuteActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UObservePlayer3ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UTargetActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UVOEmoteCommendActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UPrevWeaponActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UCommMenuOption1ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(ULeaveChatActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UOutlinesEnemyActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UCautionPingActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UCommWheelIndexActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UToggleMinimapActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UToggleMissionSettingsActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UOnMywayPingActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UOpenCommTree1ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UCommMenuOption4ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UJanusSpdDownActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UOpenCommTree4ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UGamepadDropItemsHoldActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UToggleJanusUIActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UVoteOption3ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UStrategyTacticsCommWheelActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UToggleJanusProgressActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UUseChannelObjectActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(USocialCommWheelActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UOutlinesNoneActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UJanusSpdUpActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UObservePlayer1ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UNextWeaponActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UVoteOption1ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UCommMenuOption0ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UTeamClutchMuteActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(USecondHalfUltAlternateActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UClientNavUpActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UVOEmoteJokeActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UVoteOption0ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UCommMenuOption9ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UFocusCombatReportActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UVOEmoteNoActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UFirstHalfUltAlternateActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UWhisperChatActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UObserverFollowPrevActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UToggleCharacterAbilityHUDActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(USecondHalfHalfUltInputActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UGamepadWeaponSwapTapActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UGamepadPrimaryTriggerAxisActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UShowExtendedInfoActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UToggleGamepadNavigationActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UToggleMouseCursorActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UModeToggleActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UOpenMegamapActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UOpenCommTree3ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UActivate_MeleeActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UClientNavDownActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UUseAscenderObjectActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UObservePlayer9ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UOpenCommTree2ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UNeedSupportPingActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UObservePlayer2ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UObservePlayer4ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UObservePlayer7ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UToggleSightLinesActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UDumpLiveDiagnosticsActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UVOEmoteYesActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UTeamChatActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UMoveForwardActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UCommMenuOption6ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(ULookLeftAndRight_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UGamepadSecondaryTriggerAxisActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UWatchingHerePingActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UActivate_PrimaryActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UObserverCycleCinematicCamsActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UGhostActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UActivate_SecondaryActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UGamepadShiftActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UOpenCommMenuActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UProtoAlternateFireActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UVOEmotePingActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(ULookUpAndDown_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UPingActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UCommMenuOption5ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UCommMenuOption8ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UObservePlayer6ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UVOEmoteThanksActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UInformationalHUDActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UEquipLastUsedActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UWheelNavigationActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UGamepadDropItemsTapActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UCharacterSelectActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UUncrouchActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UExpandMinimapActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UVOEmoteHelpActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UVOEmoteTauntActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UDeveloperMenuActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UVoteOption2ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UObserverMoveUpActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UVOEmoteLaughActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UUseGenericMapObjectActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UClientNavRightActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UVoteOpenActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UTogglePlayerLoadoutVisibilityActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UModifyObservePlayerActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UObservePlayer8ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UUseAlternateObjectActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UCommMenuOption2ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UClientNavLeftActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UObservePlayer10ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UAlternateMoveUpActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UToggleMapActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UVOEmoteSorryActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UCommMenuOption3ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UTouchMoveUpActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UCommMenuOption7ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UAllChatActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UMoveUpActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UToggleShopActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UExpandedCombatCommWheelActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UOutlinesFriendlyActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UToggleFreeCamActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UToggleReplayUIActionTrait_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UReplaySkipRoundForwardActionTrait_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(USecondaryTriggerDownActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UReplayTogglePlaybackActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UReplaySkipTimeBackwardActionTrait_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UPrimaryTriggerDownActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UObserverFollowNextActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UGamepadWeaponSwapHoldActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UInspectActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UActivate_LevelActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UGamepadMapCommActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(USprayActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UActivate_Ability1ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UShowScoreboardActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UGamepadWeaponSwapPressActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UUseObjectActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UActivate_Ability2ActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UGamepadSprayCommWheelActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UInGameMenuActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UCommWheelActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UToggleZoomLevelActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UWalkActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UTapWeaponSwapMelee_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UCrouchActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UActivate_UltimateActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UDropEquippableActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UActivate_GrenadeAbilityActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UPrimaryTriggerActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UFirstHalfUltInputActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(USecondaryTriggerActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UTeamPTTActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UUseAgentAbilityObjectActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UReloadActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UJumpActionTraits_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UTapWeaponSwapSecondary_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UReplayFreeCamLookActionTrait_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UReplaySkipRoundBackwardActionTrait_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UReplayUIVisibilityWheelActionTrait_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UReplaySkipTimeForwardActionTrait_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UReplayFreeCamMoveActionTrait_C) == 0x00E0); // 224 bytes (0x0000E0 - 0x0000E0)
static_assert(sizeof(UActionTraitsManager_C) == 0x0090); // 144 bytes (0x000090 - 0x000090)
