
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: ShooterGame

#pragma pack(push, 0x1)

/// Class /Game/Accolades/Aggrobot/Accolade_Aggrobot_RevengeForHomies_PrimaryAsset.Accolade_Aggrobot_RevengeForHomies_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Aggrobot_RevengeForHomies_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Aggrobot/Accolade_Aggrobot_KillAfterThrashDetain_PrimaryAsset.Accolade_Aggrobot_KillAfterThrashDetain_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Aggrobot_KillAfterThrashDetain_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Aggrobot/Accolade_Aggrobot_EnemyDiesAfterMoshPit_PrimaryAsset.Accolade_Aggrobot_EnemyDiesAfterMoshPit_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Aggrobot_EnemyDiesAfterMoshPit_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/BountyHunter/Accolade_BountyHunter_Haunt_KillAffectedEnemy_PrimaryAsset.Accolade_BountyHunter_Haunt_KillAffectedEnemy_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_BountyHunter_Haunt_KillAffectedEnemy_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/BountyHunter/Accolade_BountyHunter_NearsightTaggedEnemies_PrimaryAsset.Accolade_BountyHunter_NearsightTaggedEnemies_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_BountyHunter_NearsightTaggedEnemies_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Aggrobot/Accolade_Aggrobot_WingmanPlantOrDefuseWhileEnemiesAlive_PrimaryAsset.Accolade_Aggrobot_WingmanPlantOrDefuseWhileEnemiesAlive_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Aggrobot_WingmanPlantOrDefuseWhileEnemiesAlive_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Deadeye/Accolade_Deadeye_KillsWithUlt_PrimaryAsset.Accolade_Deadeye_KillsWithUlt_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Deadeye_KillsWithUlt_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/BountyHunter/Accolade_BountyHunter_NightfallMultipleEnemies_PrimaryAsset.Accolade_BountyHunter_NightfallMultipleEnemies_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_BountyHunter_NightfallMultipleEnemies_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Deadeye/Accolade_Deadeye_HeadshotWithHeadhunter_PrimaryAsset.Accolade_Deadeye_HeadshotWithHeadhunter_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Deadeye_HeadshotWithHeadhunter_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/BountyHunter/Accolade_BountyHunter_Seize_KillAffectedEnemy_PrimaryAsset.Accolade_BountyHunter_Seize_KillAffectedEnemy_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_BountyHunter_Seize_KillAffectedEnemy_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Deadeye/Accolade_Deadeye_TPAfterKill_PrimaryAsset.Accolade_Deadeye_TPAfterKill_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Deadeye_TPAfterKill_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Breach/Accolade_Breach_FlashMultipleEnemies_PrimaryAsset.Accolade_Breach_FlashMultipleEnemies_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Breach_FlashMultipleEnemies_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Deadeye/Accolade_Deadeye_TrapSpotEnemies_PrimaryAsset.Accolade_Deadeye_TrapSpotEnemies_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Deadeye_TrapSpotEnemies_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Breach/Accolade_Breach_KillAfterAftershockPrimaryAsset.Accolade_Breach_KillAfterAftershockPrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Breach_KillAfterAftershockPrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Breach/Accolade_Breach_KillAfterDazedByFaultline_PrimaryAsset.Accolade_Breach_KillAfterDazedByFaultline_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Breach_KillAfterDazedByFaultline_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Breach/Accolade_Breach_RollingThunderMultipleEnemies_PrimaryAsset.Accolade_Breach_RollingThunderMultipleEnemies_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Breach_RollingThunderMultipleEnemies_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Clay/Accolade_Clay_BoombotDamage_PrimaryAsset.Accolade_Clay_BoombotDamage_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Clay_BoombotDamage_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Clay/Accolade_Clay_KillAfterBlastPack_PrimaryAsset.Accolade_Clay_KillAfterBlastPack_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Clay_KillAfterBlastPack_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Grenadier/Accolade_Grenadier_DetectEnemies_PrimaryAsset.Accolade_Grenadier_DetectEnemies_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Grenadier_DetectEnemies_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Clay/Accolade_Clay_KillEnemiesAfterBoombotChase_PrimaryAsset.Accolade_Clay_KillEnemiesAfterBoombotChase_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Clay_KillEnemiesAfterBoombotChase_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Clay/Accolade_Clay_PaintshellKill_PrimaryAsset.Accolade_Clay_PaintshellKill_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Clay_PaintshellKill_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Clay/Accolade_Clay_ShowstopperKill_PrimaryAsset.Accolade_Clay_ShowstopperKill_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Clay_ShowstopperKill_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Grenadier/Accolade_Grenadier_YouOrAllyKillsOffMolly_PrimaryAsset.Accolade_Grenadier_YouOrAllyKillsOffMolly_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Grenadier_YouOrAllyKillsOffMolly_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Grenadier/Accolade_Grenadier_YouOrAllyKillsOffUlt_PrimaryAsset.Accolade_Grenadier_YouOrAllyKillsOffUlt_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Grenadier_YouOrAllyKillsOffUlt_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Grenadier/Accolade_Grenadier_FlashMultipleEnemies_PrimaryAsset.Accolade_Grenadier_FlashMultipleEnemies_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Grenadier_FlashMultipleEnemies_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Guide/Accolade_Guide_ConcussWithin30SecondsOfRoundStart_PrimaryAsset.Accolade_Guide_ConcussWithin30SecondsOfRoundStart_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Guide_ConcussWithin30SecondsOfRoundStart_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Killjoy/Accolade_Killjoy_DetainedKills_PrimaryAsset.Accolade_Killjoy_DetainedKills_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Killjoy_DetainedKills_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Guide/Accolade_Guide_YouOrAllyKillOffSeeker_PrimaryAsset.Accolade_Guide_YouOrAllyKillOffSeeker_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Guide_YouOrAllyKillOffSeeker_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Guide/Accolade_Guide_HealDamagedAlly_PrimaryAsset.Accolade_Guide_HealDamagedAlly_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Guide_HealDamagedAlly_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Guide/Accolade_Guide_FlashMultipleEnemies_PrimaryAsset.Accolade_Guide_FlashMultipleEnemies_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Guide_FlashMultipleEnemies_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Killjoy/Accolade_Killjoy_PreventPlantOrDefuseWithMolly_PrimaryAsset.Accolade_Killjoy_PreventPlantOrDefuseWithMolly_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Killjoy_PreventPlantOrDefuseWithMolly_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Gumshoe/Accolade_Gumeshoe_KillAfterRevealed_PrimaryAsset.Accolade_Gumeshoe_KillAfterRevealed_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Gumeshoe_KillAfterRevealed_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Killjoy/Accolade_Killjoy_KillAfterTurretDamage_PrimaryAsset.Accolade_Killjoy_KillAfterTurretDamage_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Killjoy_KillAfterTurretDamage_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Killjoy/Accolade_Killjoy_KillAfterDetected_PrimaryAsset.Accolade_Killjoy_KillAfterDetected_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Killjoy_KillAfterDetected_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Gumshoe/Accolade_Gumshoe_EnemyDiesAfterUlt_PrimaryAsset.Accolade_Gumshoe_EnemyDiesAfterUlt_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Gumshoe_EnemyDiesAfterUlt_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Gumshoe/Accolade_Gumshoe_TagEnemyWithCam_PrimaryAsset.Accolade_Gumshoe_TagEnemyWithCam_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Gumshoe_TagEnemyWithCam_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Gumshoe/Accolade_Gumeshoe_KillWhileInCage_PrimaryAsset.Accolade_Gumeshoe_KillWhileInCage_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Gumeshoe_KillWhileInCage_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Hunter/Accolade_Hunter_TagEnemyWithDrone_PrimaryAsset.Accolade_Hunter_TagEnemyWithDrone_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Hunter_TagEnemyWithDrone_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Hunter/Accolade_Hunter_TagEnemyWithDart_PrimaryAsset.Accolade_Hunter_TagEnemyWithDart_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Hunter_TagEnemyWithDart_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Hunter/Accolade_Hunter_KillRevealedWithUlt_PrimaryAsset.Accolade_Hunter_KillRevealedWithUlt_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Hunter_KillRevealedWithUlt_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Hunter/Accolade_Hunter_DamageWithShockDart_PrimaryAsset.Accolade_Hunter_DamageWithShockDart_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Hunter_DamageWithShockDart_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Pandemic/Accolade_Pandemic_KillInsideUltAfterSpikePlant_PrimaryAsset.Accolade_Pandemic_KillInsideUltAfterSpikePlant_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Pandemic_KillInsideUltAfterSpikePlant_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Pandemic/Accolade_Pandemic_PreventPlantOrDefuseWithMolly_PrimaryAsset.Accolade_Pandemic_PreventPlantOrDefuseWithMolly_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Pandemic_PreventPlantOrDefuseWithMolly_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Pandemic/Accolade_Pandemic_KillOnDecay_PrimaryAsset.Accolade_Pandemic_KillOnDecay_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Pandemic_KillOnDecay_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Pandemic/Accolade_Pandemic_BlockVision_PrimaryAsset.Accolade_Pandemic_BlockVision_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Pandemic_BlockVision_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Phoenix/Accolade_Phoenix_KillAfterFlash_PrimaryAsset.Accolade_Phoenix_KillAfterFlash_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Phoenix_KillAfterFlash_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Mage/Accolade_Mage_BlockDmgCove_PrimaryAsset.Accolade_Mage_BlockDmgCove_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Mage_BlockDmgCove_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Phoenix/Accolade_Phoenix_HealSelf_PrimaryAsset.Accolade_Phoenix_HealSelf_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Phoenix_HealSelf_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Phoenix/Accolade_Phoenix_KillEnemyAfterWalkThroughWall_PrimaryAsset.Accolade_Phoenix_KillEnemyAfterWalkThroughWall_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Phoenix_KillEnemyAfterWalkThroughWall_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Mage/Accolade_Mage_KillOffCascade_PrimaryAsset.Accolade_Mage_KillOffCascade_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Mage_KillOffCascade_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Mage/Accolade_Mage_WhirlpoolsInUlt_PrimaryAsset.Accolade_Mage_WhirlpoolsInUlt_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Mage_WhirlpoolsInUlt_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Nox/Accolade_Nox_KillInRazorvine_PrimaryAsset.Accolade_Nox_KillInRazorvine_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Nox_KillInRazorvine_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Nox/Accolade_Nox_FlashMultipleEnemies_PrimaryAsset.Accolade_Nox_FlashMultipleEnemies_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Nox_FlashMultipleEnemies_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Mage/Accolade_Mage_YouOrAllyKillsEnemyVisionBlockedByHighTide_PrimaryAsset.Accolade_Mage_YouOrAllyKillsEnemyVisionBlockedByHighTide_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Mage_YouOrAllyKillsEnemyVisionBlockedByHighTide_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Nox/Accolade_Nox_EnemyDiesAfterWallActivation_PrimaryAsset.Accolade_Nox_EnemyDiesAfterWallActivation_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Nox_EnemyDiesAfterWallActivation_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Phoenix/Accolade_Phoenix_KillInUlt_PrimaryAsset.Accolade_Phoenix_KillInUlt_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Phoenix_KillInUlt_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Nox/Accolade_Nox_YouOrAllyKillsOffDisarm_PrimaryAsset.Accolade_Nox_YouOrAllyKillsOffDisarm_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Nox_YouOrAllyKillsOffDisarm_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Rift/Accolade_Rift_ConcussWithNovaPulse_PrimaryAsset.Accolade_Rift_ConcussWithNovaPulse_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Rift_ConcussWithNovaPulse_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Rift/Accolade_Rift_YouOrAllyKillsOffGravWell_PrimaryAsset.Accolade_Rift_YouOrAllyKillsOffGravWell_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Rift_YouOrAllyKillsOffGravWell_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Sequoia/Accolade_Sequoia_KillDuringFragile_PrimaryAsset.Accolade_Sequoia_KillDuringFragile_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Sequoia_KillDuringFragile_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Sequoia/Accolade_Sequoia_BlockDamageWithBarrier_PrimaryAsset.Accolade_Sequoia_BlockDamageWithBarrier_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Sequoia_BlockDamageWithBarrier_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Rift/Accolade_Rift_YouOrAllyKillsOffWall_PrimaryAsset.Accolade_Rift_YouOrAllyKillsOffWall_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Rift_YouOrAllyKillsOffWall_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Rift/Accolade_Rift_YouOrAllyKillsOffNebula_PrimaryAsset.Accolade_Rift_YouOrAllyKillsOffNebula_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Rift_YouOrAllyKillsOffNebula_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Smonk/Accolade_Smonk_KillOrAssistDuringDecay_PrimaryAsset.Accolade_Smonk_KillOrAssistDuringDecay_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Smonk_KillOrAssistDuringDecay_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Sequoia/Accolade_Sequoia_KillDuringWall_PrimaryAsset.Accolade_Sequoia_KillDuringWall_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Sequoia_KillDuringWall_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Smonk/Accolade_Smonk_BlockVisionPostDeath_PrimaryAsset.Accolade_Smonk_BlockVisionPostDeath_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Smonk_BlockVisionPostDeath_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Sequoia/Accolade_Sequoia_KillDuringUlt_PrimaryAsset.Accolade_Sequoia_KillDuringUlt_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Sequoia_KillDuringUlt_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Sprinter/Accolade_Sprinter_2KillsInUlt_PrimaryAsset.Accolade_Sprinter_2KillsInUlt_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Sprinter_2KillsInUlt_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Smonk/Accolade_Smonk_KillOrAssistDuringHeal_PrimaryAsset.Accolade_Smonk_KillOrAssistDuringHeal_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Smonk_KillOrAssistDuringHeal_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Smonk/Accolade_Smonk_KillOrAssistDuringUlt_PrimaryAsset.Accolade_Smonk_KillOrAssistDuringUlt_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Smonk_KillOrAssistDuringUlt_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Sprinter/Accolade_Sprinter_BlockVision_PrimaryAsset.Accolade_Sprinter_BlockVision_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Sprinter_BlockVision_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Sprinter/Accolade_Sprinter_KillOrAssistAfterStun_PrimaryAsset.Accolade_Sprinter_KillOrAssistAfterStun_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Sprinter_KillOrAssistAfterStun_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Sprinter/Accolade_Sprinter_KillAfterSlide_PrimaryAsset.Accolade_Sprinter_KillAfterSlide_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Sprinter_KillAfterSlide_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Sarge/Accolade_Sarge_PlantAfterStim_PrimaryAsset.Accolade_Sarge_PlantAfterStim_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Sarge_PlantAfterStim_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Sarge/Accolade_Sarge_PreventPlantOrDefuseWithMolly_PrimaryAsset.Accolade_Sarge_PreventPlantOrDefuseWithMolly_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Sarge_PreventPlantOrDefuseWithMolly_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Sarge/Accolade_Sarge_BlockVision_PrimaryAsset.Accolade_Sarge_BlockVision_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Sarge_BlockVision_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Sprinter/Accolade_Sprinter_EnterFastLaneKill_PrimaryAsset.Accolade_Sprinter_EnterFastLaneKill_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Sprinter_EnterFastLaneKill_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Sarge/Accolade_Sarge_UltKillAfterPlant_PrimaryAsset.Accolade_Sarge_UltKillAfterPlant_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Sarge_UltKillAfterPlant_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Thorne/Accolade_Thorne_RoundWallDamage_PrimaryAsset.Accolade_Thorne_RoundWallDamage_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Thorne_RoundWallDamage_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Thorne/Accolade_Thorne_KillOrAssistAfterRevive_PrimaryAsset.Accolade_Thorne_KillOrAssistAfterRevive_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Thorne_KillOrAssistAfterRevive_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Thorne/Accolade_Thorne_HealAfterKill_PrimaryAsset.Accolade_Thorne_HealAfterKill_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Thorne_HealAfterKill_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Thorne/Accolade_Thorne_SlowPlayerOverTime_PrimaryAsset.Accolade_Thorne_SlowPlayerOverTime_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Thorne_SlowPlayerOverTime_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Wraith/Accolade_Wraith_BlockVision_PrimaryAsset.Accolade_Wraith_BlockVision_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Wraith_BlockVision_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Wraith/Accolade_Wraith_KillAfterShortTP_PrimaryAsset.Accolade_Wraith_KillAfterShortTP_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Wraith_KillAfterShortTP_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Wushu/Accolade_Wushu_KillAfterUpdraft_PrimaryAsset.Accolade_Wushu_KillAfterUpdraft_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Wushu_KillAfterUpdraft_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Wraith/Accolade_Wraith_PlantAfterUlt_PrimaryAsset.Accolade_Wraith_PlantAfterUlt_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Wraith_PlantAfterUlt_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Wraith/Accolade_Wraith_ParanoiaMultipleEnemies_PrimaryAsset.Accolade_Wraith_ParanoiaMultipleEnemies_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Wraith_ParanoiaMultipleEnemies_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Wushu/Accolade_Wushu_KillThroughSmoke_PrimaryAsset.Accolade_Wushu_KillThroughSmoke_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Wushu_KillThroughSmoke_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Wushu/Accolade_Wushu_KillEnemiesWithBladestorm_PrimaryAsset.Accolade_Wushu_KillEnemiesWithBladestorm_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Wushu_KillEnemiesWithBladestorm_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Stealth/Accolade_Stealth_KillAfterFlash_PrimaryAsset.Accolade_Stealth_KillAfterFlash_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Stealth_KillAfterFlash_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Stealth/Accolade_Stealth_KillAfterDecoyDamaged_PrimaryAsset.Accolade_Stealth_KillAfterDecoyDamaged_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Stealth_KillAfterDecoyDamaged_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Wushu/Accolade_Wushu_TailwindAfterKill_PrimaryAsset.Accolade_Wushu_TailwindAfterKill_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Wushu_TailwindAfterKill_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Stealth/Accolade_Stealth_KillAfterGatecrash_PrimaryAsset.Accolade_Stealth_KillAfterGatecrash_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Stealth_KillAfterGatecrash_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Stealth/Accolade_Stealth_KillAfterUlt_PrimaryAsset.Accolade_Stealth_KillAfterUlt_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Stealth_KillAfterUlt_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Vampire/Accolade_Vampire_2KillsInUlt_PrimaryAsset.Accolade_Vampire_2KillsInUlt_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Vampire_2KillsInUlt_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Vampire/Accolade_Vampire_KillBlindedByLeer_PrimaryAsset.Accolade_Vampire_KillBlindedByLeer_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Vampire_KillBlindedByLeer_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Vampire/Accolade_Vampire_KillAfterDismiss_PrimaryAsset.Accolade_Vampire_KillAfterDismiss_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Vampire_KillAfterDismiss_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/Vampire/Accolade_Vampire_KillWhileDevouringSoul_PrimaryAsset.Accolade_Vampire_KillWhileDevouringSoul_PrimaryAsset_C
/// Size: 0x00B0 (176 bytes) (0x0000B0 - 0x0000B0) align 8 MaxSize: 0x00B0
class UAccolade_Vampire_KillWhileDevouringSoul_PrimaryAsset_C : public UAccoladeDataAsset
{ 
public:
};

/// Class /Game/Accolades/_Core/Interface_AccoladeMolotov.Interface_AccoladeMolotov_C
/// Size: 0x0030 (48 bytes) (0x000030 - 0x000030) align 8 MaxSize: 0x0030
class UInterface_AccoladeMolotov_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/Accolades/_Core/Interface_AccoladeMolotov.Interface_AccoladeMolotov_C.GetApproximateArea
	// void GetApproximateArea(FVector& Center, double& Radius, double& HalfHeight);                                            // [0x1a821d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
};

#pragma pack(pop)


static_assert(sizeof(UAccolade_Aggrobot_RevengeForHomies_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Aggrobot_KillAfterThrashDetain_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Aggrobot_EnemyDiesAfterMoshPit_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_BountyHunter_Haunt_KillAffectedEnemy_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_BountyHunter_NearsightTaggedEnemies_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Aggrobot_WingmanPlantOrDefuseWhileEnemiesAlive_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Deadeye_KillsWithUlt_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_BountyHunter_NightfallMultipleEnemies_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Deadeye_HeadshotWithHeadhunter_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_BountyHunter_Seize_KillAffectedEnemy_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Deadeye_TPAfterKill_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Breach_FlashMultipleEnemies_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Deadeye_TrapSpotEnemies_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Breach_KillAfterAftershockPrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Breach_KillAfterDazedByFaultline_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Breach_RollingThunderMultipleEnemies_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Clay_BoombotDamage_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Clay_KillAfterBlastPack_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Grenadier_DetectEnemies_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Clay_KillEnemiesAfterBoombotChase_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Clay_PaintshellKill_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Clay_ShowstopperKill_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Grenadier_YouOrAllyKillsOffMolly_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Grenadier_YouOrAllyKillsOffUlt_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Grenadier_FlashMultipleEnemies_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Guide_ConcussWithin30SecondsOfRoundStart_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Killjoy_DetainedKills_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Guide_YouOrAllyKillOffSeeker_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Guide_HealDamagedAlly_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Guide_FlashMultipleEnemies_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Killjoy_PreventPlantOrDefuseWithMolly_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Gumeshoe_KillAfterRevealed_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Killjoy_KillAfterTurretDamage_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Killjoy_KillAfterDetected_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Gumshoe_EnemyDiesAfterUlt_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Gumshoe_TagEnemyWithCam_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Gumeshoe_KillWhileInCage_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Hunter_TagEnemyWithDrone_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Hunter_TagEnemyWithDart_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Hunter_KillRevealedWithUlt_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Hunter_DamageWithShockDart_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Pandemic_KillInsideUltAfterSpikePlant_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Pandemic_PreventPlantOrDefuseWithMolly_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Pandemic_KillOnDecay_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Pandemic_BlockVision_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Phoenix_KillAfterFlash_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Mage_BlockDmgCove_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Phoenix_HealSelf_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Phoenix_KillEnemyAfterWalkThroughWall_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Mage_KillOffCascade_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Mage_WhirlpoolsInUlt_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Nox_KillInRazorvine_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Nox_FlashMultipleEnemies_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Mage_YouOrAllyKillsEnemyVisionBlockedByHighTide_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Nox_EnemyDiesAfterWallActivation_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Phoenix_KillInUlt_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Nox_YouOrAllyKillsOffDisarm_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Rift_ConcussWithNovaPulse_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Rift_YouOrAllyKillsOffGravWell_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Sequoia_KillDuringFragile_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Sequoia_BlockDamageWithBarrier_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Rift_YouOrAllyKillsOffWall_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Rift_YouOrAllyKillsOffNebula_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Smonk_KillOrAssistDuringDecay_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Sequoia_KillDuringWall_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Smonk_BlockVisionPostDeath_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Sequoia_KillDuringUlt_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Sprinter_2KillsInUlt_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Smonk_KillOrAssistDuringHeal_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Smonk_KillOrAssistDuringUlt_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Sprinter_BlockVision_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Sprinter_KillOrAssistAfterStun_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Sprinter_KillAfterSlide_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Sarge_PlantAfterStim_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Sarge_PreventPlantOrDefuseWithMolly_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Sarge_BlockVision_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Sprinter_EnterFastLaneKill_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Sarge_UltKillAfterPlant_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Thorne_RoundWallDamage_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Thorne_KillOrAssistAfterRevive_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Thorne_HealAfterKill_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Thorne_SlowPlayerOverTime_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Wraith_BlockVision_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Wraith_KillAfterShortTP_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Wushu_KillAfterUpdraft_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Wraith_PlantAfterUlt_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Wraith_ParanoiaMultipleEnemies_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Wushu_KillThroughSmoke_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Wushu_KillEnemiesWithBladestorm_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Stealth_KillAfterFlash_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Stealth_KillAfterDecoyDamaged_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Wushu_TailwindAfterKill_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Stealth_KillAfterGatecrash_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Stealth_KillAfterUlt_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Vampire_2KillsInUlt_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Vampire_KillBlindedByLeer_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Vampire_KillAfterDismiss_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UAccolade_Vampire_KillWhileDevouringSoul_PrimaryAsset_C) == 0x00B0); // 176 bytes (0x0000B0 - 0x0000B0)
static_assert(sizeof(UInterface_AccoladeMolotov_C) == 0x0030); // 48 bytes (0x000030 - 0x000030)
