
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: ShooterGame

#pragma pack(push, 0x1)

/// Class /Game/BTE/BTEDataAsset.BTEDataAsset_C
/// Size: 0x00A0 (160 bytes) (0x0000A0 - 0x0000A0) align 8 MaxSize: 0x00A0
class UBTEDataAsset_C : public UBTEDataAsset
{ 
public:
};

/// Class /Game/BTE/BTEMilestone3_UIData.BTEMilestone3_UIData_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UBTEMilestone3_UIData_C : public UBTEMilestoneUIData
{ 
public:
};

/// Class /Game/BTE/BTEMilestone4_UIData.BTEMilestone4_UIData_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UBTEMilestone4_UIData_C : public UBTEMilestoneUIData
{ 
public:
};

/// Class /Game/BTE/BTEMilestone2_UIData.BTEMilestone2_UIData_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UBTEMilestone2_UIData_C : public UBTEMilestoneUIData
{ 
public:
};

/// Class /Game/BTE/BTEMilestone1_UIData.BTEMilestone1_UIData_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UBTEMilestone1_UIData_C : public UBTEMilestoneUIData
{ 
public:
};

/// Class /Game/BTE/BTEMilestone5_UIData.BTEMilestone5_UIData_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UBTEMilestone5_UIData_C : public UBTEMilestoneUIData
{ 
public:
};

#pragma pack(pop)


static_assert(sizeof(UBTEDataAsset_C) == 0x00A0); // 160 bytes (0x0000A0 - 0x0000A0)
static_assert(sizeof(UBTEMilestone3_UIData_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UBTEMilestone4_UIData_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UBTEMilestone2_UIData_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UBTEMilestone1_UIData_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UBTEMilestone5_UIData_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
