
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: GameplayAbilities
/// dependency: ShooterGame

#pragma pack(push, 0x1)

/// Class /Game/Buffs/AssistBuffs/Buff_Assist_Concuss.Buff_Assist_Concuss_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UBuff_Assist_Concuss_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/FXC_TimeoutFreeze.FXC_TimeoutFreeze_C
/// Size: 0x0610 (1552 bytes) (0x0005F8 - 0x000610) align 16 MaxSize: 0x0610
class AFXC_TimeoutFreeze_C : public AEffectContainer
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x05F8   (0x0008)  MISSED
	class UPostProcessComponent*                       PostProcess;                                                // 0x0600   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0608   (0x0008)  
};

/// Class /Game/Buffs/RegenArmorBuff.RegenArmorBuff_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class URegenArmorBuff_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/PreventSwitchingEquippablesBuff.PreventSwitchingEquippablesBuff_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UPreventSwitchingEquippablesBuff_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/WeaponDownBuff.WeaponDownBuff_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UWeaponDownBuff_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/Buff_BombSpike_Detain.Buff_BombSpike_Detain_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UBuff_BombSpike_Detain_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/Buff_InteractionFreeze.Buff_InteractionFreeze_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UBuff_InteractionFreeze_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/DisconnectedBuff.DisconnectedBuff_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UDisconnectedBuff_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/Buff_PreventFiring.Buff_PreventFiring_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UBuff_PreventFiring_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/Buff_ExtraGrenade.Buff_ExtraGrenade_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UBuff_ExtraGrenade_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/CanPickupBombBuff.CanPickupBombBuff_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UCanPickupBombBuff_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/Buff_TimeoutFreeze.Buff_TimeoutFreeze_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UBuff_TimeoutFreeze_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/Debuff_GrievousWounds.Debuff_GrievousWounds_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UDebuff_GrievousWounds_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/AssistBuffs/Buff_AssistTail_Slow.Buff_AssistTail_Slow_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UBuff_AssistTail_Slow_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/AssistBuffs/Buff_Assist_Resurrection.Buff_Assist_Resurrection_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UBuff_Assist_Resurrection_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/CanSeeHealthBuff.CanSeeHealthBuff_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UCanSeeHealthBuff_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/AssistBuffs/Buff_Assist_Heal.Buff_Assist_Heal_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UBuff_Assist_Heal_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/SmokeBombCastingBuff.SmokeBombCastingBuff_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class USmokeBombCastingBuff_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/PreventDroppingEquippablesBuff.PreventDroppingEquippablesBuff_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UPreventDroppingEquippablesBuff_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/AssistBuffs/Buff_AssistTail_Smoke.Buff_AssistTail_Smoke_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UBuff_AssistTail_Smoke_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/AssistBuffs/Buff_Assist_Smoke.Buff_Assist_Smoke_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UBuff_Assist_Smoke_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/Debuff_Disabled.Debuff_Disabled_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UDebuff_Disabled_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/AssistBuffs/Buff_Assist_Reveal.Buff_Assist_Reveal_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UBuff_Assist_Reveal_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/AssistBuffs/Buff_AssistTail_Blind.Buff_AssistTail_Blind_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UBuff_AssistTail_Blind_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/AssistBuffs/Buff_Assist_BlindLong.Buff_Assist_BlindLong_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UBuff_Assist_BlindLong_C : public UAresGameplayBuff
{ 
public:
};

/// Class /Game/Buffs/Buff_HealsFromAllyFlames.Buff_HealsFromAllyFlames_C
/// Size: 0x0C18 (3096 bytes) (0x000C18 - 0x000C18) align 8 MaxSize: 0x0C18
class UBuff_HealsFromAllyFlames_C : public UAresGameplayBuff
{ 
public:
};

#pragma pack(pop)


static_assert(sizeof(UBuff_Assist_Concuss_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(AFXC_TimeoutFreeze_C) == 0x0610); // 1552 bytes (0x0005F8 - 0x000610)
static_assert(sizeof(URegenArmorBuff_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UPreventSwitchingEquippablesBuff_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UWeaponDownBuff_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UBuff_BombSpike_Detain_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UBuff_InteractionFreeze_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UDisconnectedBuff_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UBuff_PreventFiring_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UBuff_ExtraGrenade_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UCanPickupBombBuff_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UBuff_TimeoutFreeze_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UDebuff_GrievousWounds_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UBuff_AssistTail_Slow_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UBuff_Assist_Resurrection_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UCanSeeHealthBuff_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UBuff_Assist_Heal_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(USmokeBombCastingBuff_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UPreventDroppingEquippablesBuff_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UBuff_AssistTail_Smoke_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UBuff_Assist_Smoke_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UDebuff_Disabled_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UBuff_Assist_Reveal_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UBuff_AssistTail_Blind_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UBuff_Assist_BlindLong_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(sizeof(UBuff_HealsFromAllyFlames_C) == 0x0C18); // 3096 bytes (0x000C18 - 0x000C18)
static_assert(offsetof(AFXC_TimeoutFreeze_C, PostProcess) == 0x0600);
static_assert(offsetof(AFXC_TimeoutFreeze_C, DefaultSceneRoot) == 0x0608);
