
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: CommonUI
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: ModelViewViewModel
/// dependency: ShooterGame
/// dependency: UI
/// dependency: UMG

#pragma pack(push, 0x1)

/// Enum /Game/ContextAwareModule/Widgets/HighlightType.HighlightType
/// Size: 0x01 (1 bytes)
enum class HighlightType : uint8_t
{
	HighlightType__NewEnumerator3                                                    = 0,
	HighlightType__NewEnumerator0                                                    = 1,
	HighlightType__NewEnumerator1                                                    = 2,
	HighlightType__NewEnumerator2                                                    = 3,
	HighlightType__NewEnumerator4                                                    = 4,
	HighlightType__NewEnumerator5                                                    = 5,
	HighlightType__NewEnumerator6                                                    = 6
};

/// Class /Game/ContextAwareModule/Tips/Abilities/Tip_UseSignature_PrimaryAsset.Tip_UseSignature_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_UseSignature_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Abilities/Tip_UseAbility_PrimaryAsset.Tip_UseAbility_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_UseAbility_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Abilities/Tip_UltPoints_PrimaryAsset.Tip_UltPoints_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_UltPoints_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Abilities/Tip_UseUlt_PrimaryAsset.Tip_UseUlt_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_UseUlt_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/AttackDefend/Tip_FirstDefend_PrimaryAsset.Tip_FirstDefend_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_FirstDefend_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/AttackDefend/Tip_FirstDeath_PrimaryAsset.Tip_FirstDeath_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_FirstDeath_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/AttackDefend/Tip_FirstAttack_PrimaryAsset.Tip_FirstAttack_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_FirstAttack_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/AttackDefend/Tip_DefuseWin_PrimaryAsset.Tip_DefuseWin_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_DefuseWin_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/AttackDefend/Tip_PlantSpike_PrimaryAsset.Tip_PlantSpike_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PlantSpike_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/AttackDefend/Tip_SpikeWin_PrimaryAsset.Tip_SpikeWin_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_SpikeWin_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/AttackDefend/Tip_SpikeWithTeam_PrimaryAsset.Tip_SpikeWithTeam_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_SpikeWithTeam_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Economy/Tip_BuyAR_PrimaryAsset.Tip_BuyAR_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_BuyAR_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Economy/Tip_BuyAbilities_PrimaryAsset.Tip_BuyAbilities_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_BuyAbilities_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Economy/Tip_BuyArmor_PrimaryAsset.Tip_BuyArmor_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_BuyArmor_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Economy/Tip_FirstBuy_PrimaryAsset.Tip_FirstBuy_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_FirstBuy_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Economy/Tip_EarnCredits_PrimaryAsset.Tip_EarnCredits_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_EarnCredits_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Economy/Tip_BuyPrimary_PrimaryAsset.Tip_BuyPrimary_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_BuyPrimary_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Economy/Tip_FullBuy_PrimaryAsset.Tip_FullBuy_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_FullBuy_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Economy/Tip_Request_PrimaryAsset.Tip_Request_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_Request_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Movement/Tip_Walk_PrimaryAsset.Tip_Walk_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_Walk_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Map/Tip_FirstUltOrb_PrimaryAsset.Tip_FirstUltOrb_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_FirstUltOrb_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Economy/Tip_YouHaveXCredits_PrimaryAsset.Tip_YouHaveXCredits_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_YouHaveXCredits_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Economy/Tip_Saving_PrimaryAsset.Tip_Saving_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_Saving_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/ShootingRange/Tip_ShootingTest_DataAsset.Tip_ShootingTest_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_ShootingTest_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/Tip_MovementError_PrimaryAsset.Tip_MovementError_PrimaryAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_MovementError_PrimaryAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/ShootingRange/Tip_FirstRange_DataAsset.Tip_FirstRange_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_FirstRange_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/ShootingRange/Tip_FirstAgentSwitching_DataAsset.Tip_FirstAgentSwitching_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_FirstAgentSwitching_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Bucky_DataAsset.Tip_PerWeapon_Bucky_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Bucky_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Bulldog_DataAsset.Tip_PerWeapon_Bulldog_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Bulldog_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Ares_DataAsset.Tip_PerWeapon_Ares_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Ares_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Guardian_DataAsset.Tip_PerWeapon_Guardian_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Guardian_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Ghost_DataAsset.Tip_PerWeapon_Ghost_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Ghost_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Frenzy_DataAsset.Tip_PerWeapon_Frenzy_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Frenzy_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Classic_DataAsset.Tip_PerWeapon_Classic_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Classic_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Marshal_DataAsset.Tip_PerWeapon_Marshal_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Marshal_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Operator_DataAsset.Tip_PerWeapon_Operator_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Operator_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Odin_DataAsset.Tip_PerWeapon_Odin_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Odin_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Judge_DataAsset.Tip_PerWeapon_Judge_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Judge_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Sheriff_DataAsset.Tip_PerWeapon_Sheriff_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Sheriff_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Phantom_DataAsset.Tip_PerWeapon_Phantom_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Phantom_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Outlaw_DataAsset.Tip_PerWeapon_Outlaw_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Outlaw_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Spectre_DataAsset.Tip_PerWeapon_Spectre_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Spectre_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Stinger_DataAsset.Tip_PerWeapon_Stinger_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Stinger_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Shorty_DataAsset.Tip_PerWeapon_Shorty_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Shorty_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/Weapon/PerWeaponTip/Tip_PerWeapon_Vandal_DataAsset.Tip_PerWeapon_Vandal_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UTip_PerWeapon_Vandal_DataAsset_C : public UTipDataAsset
{ 
public:
};

/// Class /Game/ContextAwareModule/Tips/TipInterface.TipInterface_C
/// Size: 0x0030 (48 bytes) (0x000030 - 0x000030) align 8 MaxSize: 0x0030
class UTipInterface_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/ContextAwareModule/Tips/TipInterface.TipInterface_C.TipHidden
	// void TipHidden();                                                                                                        // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipInterface.TipInterface_C.TipShown
	// void TipShown();                                                                                                         // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipInterface.TipInterface_C.OnSpawnInitComplete
	// void OnSpawnInitComplete();                                                                                              // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipInterface.TipInterface_C.OnTipShowComplete
	// void OnTipShowComplete();                                                                                                // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipInterface.TipInterface_C.OnBetweenRounds
	// void OnBetweenRounds();                                                                                                  // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipInterface.TipInterface_C.OnBuyPhaseStart
	// void OnBuyPhaseStart(int32_t RoundNumber);                                                                               // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipInterface.TipInterface_C.OnRoundEnd
	// void OnRoundEnd();                                                                                                       // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipInterface.TipInterface_C.OnRoundStart
	// void OnRoundStart();                                                                                                     // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipInterface.TipInterface_C.EvaluateToShow
	// void EvaluateToShow(bool& WantsToShow);                                                                                  // [0x1a821d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/ContextAwareModule/Blueprints/ContextDetectionActorBase.ContextDetectionActorBase_C
/// Size: 0x0468 (1128 bytes) (0x000460 - 0x000468) align 8 MaxSize: 0x0468
class AContextDetectionActorBase_C : public AContextDetectionActor
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0460   (0x0008)  
};

/// Class /Game/ContextAwareModule/Widgets/WBP_View_TipText.WBP_View_TipText_C
/// Size: 0x0408 (1032 bytes) (0x0003E0 - 0x000408) align 8 MaxSize: 0x0408
class UWBP_View_TipText_C : public UAresCommonUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x03E0   (0x0008)  
	class UWidgetAnimation*                            Ani_Outro;                                                  // 0x03E8   (0x0008)  
	class UWidgetAnimation*                            Ani_Intro;                                                  // 0x03F0   (0x0008)  
	class UTextBlock*                                  TipTextContent;                                             // 0x03F8   (0x0008)  
	class UVM_ContextAwareModule_Tip_C*                TipViewModel;                                               // 0x0400   (0x0008)  


	/// Functions
	// Function /Game/ContextAwareModule/Widgets/WBP_View_TipText.WBP_View_TipText_C.RefreshView
	// void RefreshView();                                                                                                      // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Widgets/WBP_View_TipText.WBP_View_TipText_C.UnbindEvents
	// void UnbindEvents();                                                                                                     // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Widgets/WBP_View_TipText.WBP_View_TipText_C.BindEvents
	// void BindEvents();                                                                                                       // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Widgets/WBP_View_TipText.WBP_View_TipText_C.InitViewModel
	// void InitViewModel();                                                                                                    // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Widgets/WBP_View_TipText.WBP_View_TipText_C.Finished_F8D86758452E8A828BE40794EF7A0CD7
	// void Finished_F8D86758452E8A828BE40794EF7A0CD7();                                                                        // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Widgets/WBP_View_TipText.WBP_View_TipText_C.K2_BindToViewModel
	// void K2_BindToViewModel();                                                                                               // [0x1a821d0] Event|Public|BlueprintEvent 
	// Function /Game/ContextAwareModule/Widgets/WBP_View_TipText.WBP_View_TipText_C.DisplayTip
	// void DisplayTip(class ATipBase_C* Tip);                                                                                  // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Widgets/WBP_View_TipText.WBP_View_TipText_C.ShowTip
	// void ShowTip(class ATipBase_C* Tip);                                                                                     // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Widgets/WBP_View_TipText.WBP_View_TipText_C.HideTip
	// void HideTip(class ATipBase_C* Tip);                                                                                     // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Widgets/WBP_View_TipText.WBP_View_TipText_C.Destruct
	// void Destruct();                                                                                                         // [0x1a821d0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/ContextAwareModule/Widgets/WBP_View_TipText.WBP_View_TipText_C.ExecuteUbergraph_WBP_View_TipText
	// void ExecuteUbergraph_WBP_View_TipText(int32_t EntryPoint);                                                              // [0x1a821d0] Final                
};

/// Class /Game/ContextAwareModule/Blueprints/VM_ContextAwareModule_Tip.VM_ContextAwareModule_Tip_C
/// Size: 0x00E0 (224 bytes) (0x000090 - 0x0000E0) align 8 MaxSize: 0x00E0
class UVM_ContextAwareModule_Tip_C : public UContextAwareModuleViewModel
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0090   (0x0008)  
	SDK_UNDEFINED(16,5087) /* FMulticastInlineDelegate */ __um(OnTipDisplayed);                                    // 0x0098   (0x0010)  
	SDK_UNDEFINED(16,5088) /* FMulticastInlineDelegate */ __um(OnTipHidden);                                       // 0x00A8   (0x0010)  
	class UContextAwareModuleManagerComponent_C*       ManagerComponent;                                           // 0x00B8   (0x0008)  
	SDK_UNDEFINED(16,5089) /* FMulticastInlineDelegate */ __um(OnTipShown);                                        // 0x00C0   (0x0010)  
	bool                                               IsTipVisible;                                               // 0x00D0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00D1   (0x0007)  MISSED
	class ATipBase_C*                                  CurrentTip;                                                 // 0x00D8   (0x0008)  


	/// Functions
	// Function /Game/ContextAwareModule/Blueprints/VM_ContextAwareModule_Tip.VM_ContextAwareModule_Tip_C.SetupViewModel
	// void SetupViewModel();                                                                                                   // [0x1a821d0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Blueprints/VM_ContextAwareModule_Tip.VM_ContextAwareModule_Tip_C.OnViewModelCreated
	// void OnViewModelCreated();                                                                                               // [0x1a821d0] Event|Protected|BlueprintEvent 
	// Function /Game/ContextAwareModule/Blueprints/VM_ContextAwareModule_Tip.VM_ContextAwareModule_Tip_C.DisplayTip
	// void DisplayTip(class ATipBase_C* Tip);                                                                                  // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Blueprints/VM_ContextAwareModule_Tip.VM_ContextAwareModule_Tip_C.HideTip
	// void HideTip();                                                                                                          // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Blueprints/VM_ContextAwareModule_Tip.VM_ContextAwareModule_Tip_C.ShowTip
	// void ShowTip();                                                                                                          // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Blueprints/VM_ContextAwareModule_Tip.VM_ContextAwareModule_Tip_C.LoadCurrentTipState
	// void LoadCurrentTipState();                                                                                              // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Blueprints/VM_ContextAwareModule_Tip.VM_ContextAwareModule_Tip_C.ExecuteUbergraph_VM_ContextAwareModule_Tip
	// void ExecuteUbergraph_VM_ContextAwareModule_Tip(int32_t EntryPoint);                                                     // [0x1a821d0] Final                
	// Function /Game/ContextAwareModule/Blueprints/VM_ContextAwareModule_Tip.VM_ContextAwareModule_Tip_C.OnTipShown__DelegateSignature
	// void OnTipShown__DelegateSignature(class ATipBase_C* Tip);                                                               // [0x1a821d0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Blueprints/VM_ContextAwareModule_Tip.VM_ContextAwareModule_Tip_C.OnTipHidden__DelegateSignature
	// void OnTipHidden__DelegateSignature(class ATipBase_C* Tip);                                                              // [0x1a821d0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Blueprints/VM_ContextAwareModule_Tip.VM_ContextAwareModule_Tip_C.OnTipDisplayed__DelegateSignature
	// void OnTipDisplayed__DelegateSignature(class ATipBase_C* Tip);                                                           // [0x1a821d0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/ContextAwareModule/Tips/TipBase.TipBase_C
/// Size: 0x0560 (1376 bytes) (0x0004D0 - 0x000560) align 8 MaxSize: 0x0560
class ATipBase_C : public ATip
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04D0   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x04D8   (0x0008)  
	bool                                               Valid;                                                      // 0x04E0   (0x0001)  
	TEnumAsByte<HighlightType>                         HighlightType;                                              // 0x04E1   (0x0001)  
	bool                                               ShownThisRound;                                             // 0x04E2   (0x0001)  
	unsigned char                                      UnknownData00_6[0x5];                                       // 0x04E3   (0x0005)  MISSED
	SDK_UNDEFINED(16,5090) /* FMulticastInlineDelegate */ __um(OnTipResolvedAndCleared);                           // 0x04E8   (0x0010)  
	double                                             MaxDurationTipShouldBeShownInBuyPhase;                      // 0x04F8   (0x0008)  
	bool                                               IsCurrentlyShown;                                           // 0x0500   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0501   (0x0007)  MISSED
	SDK_UNDEFINED(16,5091) /* FMulticastInlineDelegate */ __um(OnTipWantsToBeShown);                               // 0x0508   (0x0010)  
	SDK_UNDEFINED(16,5092) /* FMulticastInlineDelegate */ __um(OnTipStopToBeShown);                                // 0x0518   (0x0010)  
	TArray<EAresGamePhase>                             GamePhaseToEvaluate;                                        // 0x0528   (0x0010)  
	TArray<EAresGamePhase>                             GamePhaseToStop;                                            // 0x0538   (0x0010)  
	double                                             MinShowTimeBeforeResolve;                                   // 0x0548   (0x0008)  
	FTimerHandle                                       TipShownContinuouslyTimer;                                  // 0x0550   (0x0008)  
	double                                             ShowTimeRemaining;                                          // 0x0558   (0x0008)  


	/// Functions
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.EvaluateToShow
	// void EvaluateToShow(bool& WantsToShow);                                                                                  // [0x1a821d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.TipShownLongEnoughToResolve
	// void TipShownLongEnoughToResolve();                                                                                      // [0x1a821d0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.Stop Show on Game Phase
	// void StopShowonGamePhase(EAresGamePhase TargetGamePhase);                                                                // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.BindToOnTipShowComplete
	// void BindToOnTipShowComplete(class UContextAwareModuleManagerComponent_C* ContextAwareModuleManager);                    // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.TryBroadcastStopToBeShown
	// void TryBroadcastStopToBeShown();                                                                                        // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.TryBroadcastWantsToBeShown
	// void TryBroadcastWantsToBeShown();                                                                                       // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.Evaluate Show on Game Phase
	// void EvaluateShowonGamePhase(EAresGamePhase TargetGamePhase);                                                            // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.GetTipValidity
	// bool GetTipValidity(ETipPossibleDisplayTimes RequestedDisplayTime);                                                      // [0x1a821d0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.CalculateMaxDurationTipShouldBeShown
	// double CalculateMaxDurationTipShouldBeShown();                                                                           // [0x1a821d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.ResolveTip
	// void ResolveTip();                                                                                                       // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.ClearTip
	// void ClearTip();                                                                                                         // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.ResolveAndClearTip
	// void ResolveAndClearTip();                                                                                               // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.SetTipValidity
	// void SetTipValidity(bool IsValid);                                                                                       // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.OnBuyPhaseStart
	// void OnBuyPhaseStart(int32_t RoundNumber);                                                                               // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.OnTipShowComplete
	// void OnTipShowComplete();                                                                                                // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.OnSpawnInitComplete
	// void OnSpawnInitComplete();                                                                                              // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.OnGamePhaseChange
	// void OnGamePhaseChange(EAresGamePhase NewGamePhase, int32_t RoundNumberEnded);                                           // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.OnRoundEnd
	// void OnRoundEnd();                                                                                                       // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.OnRoundStart
	// void OnRoundStart();                                                                                                     // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1a821d0] Event|Protected|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.OnBetweenRounds
	// void OnBetweenRounds();                                                                                                  // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.TipShown
	// void TipShown();                                                                                                         // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.TipHidden
	// void TipHidden();                                                                                                        // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.ExecuteUbergraph_TipBase
	// void ExecuteUbergraph_TipBase(int32_t EntryPoint);                                                                       // [0x1a821d0] Final|HasDefaults    
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.OnTipStopToBeShown__DelegateSignature
	// void OnTipStopToBeShown__DelegateSignature(class ATipBase_C* TipToStop);                                                 // [0x1a821d0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.OnTipWantsToBeShown__DelegateSignature
	// void OnTipWantsToBeShown__DelegateSignature(class ATipBase_C* TipToShow);                                                // [0x1a821d0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/Tips/TipBase.TipBase_C.OnTipResolvedAndCleared__DelegateSignature
	// void OnTipResolvedAndCleared__DelegateSignature(class ATipBase_C* Tip);                                                  // [0x1a821d0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/ContextAwareModule/Widgets/WBP_Tip.WBP_Tip_C
/// Size: 0x0320 (800 bytes) (0x000318 - 0x000320) align 8 MaxSize: 0x0320
class UWBP_Tip_C : public UUserWidget
{ 
public:
	class UWBP_View_TipText_C*                         WBP_View_TipText;                                           // 0x0318   (0x0008)  
};

/// Class /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C
/// Size: 0x0470 (1136 bytes) (0x0002E8 - 0x000470) align 8 MaxSize: 0x0470
class UContextAwareModuleManagerComponent_C : public UContextAwareModuleManagerComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E8   (0x0008)  
	TArray<class ATipBase_C*>                          TipsToShow;                                                 // 0x02F0   (0x0010)  
	class ATipBase_C*                                  CurrentShownTip;                                            // 0x0300   (0x0008)  
	class UVM_ContextAwareModule_Tip_C*                TipViewModel;                                               // 0x0308   (0x0008)  
	class UWBP_Tip_C*                                  TipHUDContainerWidget;                                      // 0x0310   (0x0008)  
	double                                             MinRoundTimeRemainingForTipToShow;                          // 0x0318   (0x0008)  
	FTimerHandle                                       ShowTipOnSetupCompleteTimerHandle;                          // 0x0320   (0x0008)  
	double                                             DelayBeforeShowingTipsAfterSetup;                           // 0x0328   (0x0008)  
	FTimerHandle                                       ShowFollowUpTipTimerHandle;                                 // 0x0330   (0x0008)  
	double                                             DelayBeforeShowingFollowUpTip;                              // 0x0338   (0x0008)  
	double                                             DelayBeforeShowingFollowUpTip_InShootingRange;              // 0x0340   (0x0008)  
	FTimerHandle                                       HideTipTimerHandle;                                         // 0x0348   (0x0008)  
	class AShooterCharacter*                           SpawnedCharacter;                                           // 0x0350   (0x0008)  
	FTimerHandle                                       SlowTickTimerHandle;                                        // 0x0358   (0x0008)  
	TArray<class Uitem_C*>                             HighlightedItems;                                           // 0x0360   (0x0010)  
	class UShopContentWidgetBase_C*                    ShopContent;                                                // 0x0370   (0x0008)  
	class UShopScreen*                                 ShopScreen;                                                 // 0x0378   (0x0008)  
	TEnumAsByte<HighlightType>                         HighlightType;                                              // 0x0380   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0381   (0x0007)  MISSED
	TArray<class Uitem_C*>                             ShopGuns;                                                   // 0x0388   (0x0010)  
	TArray<class Uitem_C*>                             ShopAbilities;                                              // 0x0398   (0x0010)  
	TArray<class Uitem_C*>                             ShopArmors;                                                 // 0x03A8   (0x0010)  
	TArray<class Uitem_C*>                             ShopAssaultRifles;                                          // 0x03B8   (0x0010)  
	TMap<class ATip*, int32_t>                         TipsToGracePeriodRounds;                                    // 0x03C8   (0x0050)  
	bool                                               PrevCanShowTips;                                            // 0x0418   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0419   (0x0007)  MISSED
	class UBaseUsableHUDComponent_C*                   CurrentMainUsableHUDComponent;                              // 0x0420   (0x0008)  
	bool                                               JustHadSwitchingTeamsPhase;                                 // 0x0428   (0x0001)  
	EAresTeamRole                                      PreviousTeamRole;                                           // 0x0429   (0x0001)  
	unsigned char                                      UnknownData02_6[0x6];                                       // 0x042A   (0x0006)  MISSED
	FTimerHandle                                       SetupShopEventsTimerHandle;                                 // 0x0430   (0x0008)  
	class UCharacterAbilitiesTooltip_Base_C*           CharacterAbilitiesTooltipBase;                              // 0x0438   (0x0008)  
	FTimerHandle                                       SetupChallengeSequenceEventsTimerHandle;                    // 0x0440   (0x0008)  
	double                                             ToBeShownGracePeriod;                                       // 0x0448   (0x0008)  
	SDK_UNDEFINED(16,5093) /* FMulticastInlineDelegate */ __um(OnTipShowComplete);                                 // 0x0450   (0x0010)  
	class UScoreboardContentWidgetBase_C*              ScoreboardScreen;                                           // 0x0460   (0x0008)  
	class UContextAwareModuleDebugComponent*           CAMDebugComponent;                                          // 0x0468   (0x0008)  


	/// Functions
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.ShootingRangeChallengeEnded
	// void ShootingRangeChallengeEnded();                                                                                      // [0x1a821d0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.Menu Stack Changed
	// void MenuStackChanged(class UMenuStackEntry* TopEntry);                                                                  // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.AddDisplayStateDebugStatement
	// void AddDisplayStateDebugStatement(FString Key, FString Value);                                                          // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.GetScoreboardWidget
	// void GetScoreboardWidget(class UScoreboardContentWidgetBase_C*& ScoreboardWidget);                                       // [0x1a821d0] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.RemoveFromTipToShow
	// void RemoveFromTipToShow(class ATipBase_C* RemovedTip, bool RemoveAll);                                                  // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.AddTipToShow
	// void AddTipToShow(class ATipBase_C* NewTip);                                                                             // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.SetupChallengeSequenceEvents_InShootingRange
	// void SetupChallengeSequenceEvents_InShootingRange();                                                                     // [0x1a821d0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.GetCharacterAbilitiesTooltipBase
	// class UCharacterAbilitiesTooltip_Base_C* GetCharacterAbilitiesTooltipBase();                                             // [0x1a821d0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.SetupShopEvents
	// void SetupShopEvents();                                                                                                  // [0x1a821d0] Private|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.TryRegisterTipGracePeriod
	// void TryRegisterTipGracePeriod(class ATip*& Tip);                                                                        // [0x1a821d0] Private|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.ClearOldGracePeriods
	// void ClearOldGracePeriods();                                                                                             // [0x1a821d0] Private|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.TipIsInGracePeriod
	// void TipIsInGracePeriod(class ATip* TipToCheck, bool& GracePeriodActive);                                                // [0x1a821d0] Private|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.UpdateHighlightForShopItem
	// void UpdateHighlightForShopItem(class Uitem_C* ShopItem);                                                                // [0x1a821d0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.GetShopWidgetsFromItems
	// void GetShopWidgetsFromItems(TArray<TSoftObjectPtr<UClass*>>& Items, TArray<Uitem_C*>& InShopWidgets);                   // [0x1a821d0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.GetShopItemsFromHighlightType
	// void GetShopItemsFromHighlightType(TEnumAsByte<HighlightType> HighlightType, TArray<Uitem_C*>& ShopItems);               // [0x1a821d0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.HandleSpawnedCharacterChanged
	// void HandleSpawnedCharacterChanged(class AShooterCharacter* NewValue);                                                   // [0x1a821d0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.GameModeIsShootingRange
	// bool GameModeIsShootingRange();                                                                                          // [0x1a821d0] Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.GetPlayerState
	// class AShooterPlayerState* GetPlayerState();                                                                             // [0x1a821d0] Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.GetDelayBeforeShowingFollowUpTip
	// double GetDelayBeforeShowingFollowUpTip();                                                                               // [0x1a821d0] Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.CanShowHighlights
	// void CanShowHighlights(bool& CanDisplayHighlights);                                                                      // [0x1a821d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.TipsBlockedByGameplayState
	// bool TipsBlockedByGameplayState();                                                                                       // [0x1a821d0] Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.TipsBlockedByImportantUI
	// bool TipsBlockedByImportantUI();                                                                                         // [0x1a821d0] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.CanShowTips
	// void CanShowTips(bool& CanDisplay);                                                                                      // [0x1a821d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.IsShowingTip
	// void IsShowingTip(bool& IsShowing);                                                                                      // [0x1a821d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.TryShowFollowUpTip
	// void TryShowFollowUpTip();                                                                                               // [0x1a821d0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.DisplayTip
	// void DisplayTip(class ATipBase_C* NewTip, bool& DisplaySuccess);                                                         // [0x1a821d0] Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.SortTipsPred
	// void SortTipsPred(class UObject* Left, class UObject* Right, bool& bIsLeftLessThanRight);                                // [0x1a821d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.PickBestTip
	// void PickBestTip(TArray<ATipBase_C*>& Tips, class ATipBase_C*& BestTip);                                                 // [0x1a821d0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.GetTipsToShow
	// void GetTipsToShow(TArray<ATipBase_C*>& ValidTips);                                                                      // [0x1a821d0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.ClearTip
	// void ClearTip();                                                                                                         // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.TryDisplayTip
	// void TryDisplayTip();                                                                                                    // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.TryDisplayTipOnSetupComplete
	// void TryDisplayTipOnSetupComplete();                                                                                     // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.SlowTick
	// void SlowTick();                                                                                                         // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.OnTipTimerExpire
	// void OnTipTimerExpire();                                                                                                 // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.UpdateHighlights
	// void UpdateHighlights();                                                                                                 // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.ClearAllHighlights
	// void ClearAllHighlights();                                                                                               // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.OnShopVisibilityChanged
	// void OnShopVisibilityChanged(ESlateVisibility InVisibility);                                                             // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.ReceiveSetupContextAwareModule
	// void ReceiveSetupContextAwareModule();                                                                                   // [0x1a821d0] Event|Protected|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.ReceiveTeardownContextAwareModule
	// void ReceiveTeardownContextAwareModule();                                                                                // [0x1a821d0] Event|Protected|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.OnTipSpawned
	// void OnTipSpawned(class ATip* NewTip);                                                                                   // [0x1a821d0] Event|Protected|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.OnMainUsableHudUpdated
	// void OnMainUsableHudUpdated(class UBaseUsableHUDComponent_C* HUDComponent, bool CurrentlyInUse);                         // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x1a821d0] Event|Public|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.OnShopItemModelUpdated
	// void OnShopItemModelUpdated();                                                                                           // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.OnTipWantsToBeShown
	// void OnTipWantsToBeShown(class ATipBase_C* TipToShow);                                                                   // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.OnTipStopToBeShown
	// void OnTipStopToBeShown(class ATipBase_C* TipToStop);                                                                    // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.OnCommonUIShopVisibilityChanged
	// void OnCommonUIShopVisibilityChanged(bool IsVisible);                                                                    // [0x1a821d0] BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.ExecuteUbergraph_ContextAwareModuleManagerComponent
	// void ExecuteUbergraph_ContextAwareModuleManagerComponent(int32_t EntryPoint);                                            // [0x1a821d0] Final|HasDefaults    
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent.ContextAwareModuleManagerComponent_C.OnTipShowComplete__DelegateSignature
	// void OnTipShowComplete__DelegateSignature();                                                                             // [0x1a821d0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/ContextAwareModule/ContextAwareModuleManagerComponent_Desktop.ContextAwareModuleManagerComponent_Desktop_C
/// Size: 0x0480 (1152 bytes) (0x000470 - 0x000480) align 8 MaxSize: 0x0480
class UContextAwareModuleManagerComponent_Desktop_C : public UContextAwareModuleManagerComponent_C
{ 
public:
	class UpingWidget_C*                               PingWidget;                                                 // 0x0470   (0x0008)  
	class UScoreboardContentWidgetBase_C*              ScoreboardScreen;                                           // 0x0478   (0x0008)  


	/// Functions
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent_Desktop.ContextAwareModuleManagerComponent_Desktop_C.GetPingWheel
	// void GetPingWheel(class UpingWidget_C*& PingWidget);                                                                     // [0x1a821d0] Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/ContextAwareModule/ContextAwareModuleManagerComponent_Desktop.ContextAwareModuleManagerComponent_Desktop_C.TipsBlockedByImportantUI
	// bool TipsBlockedByImportantUI();                                                                                         // [0x1a821d0] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
