
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: ShooterGame

#pragma pack(push, 0x1)

/// Class /Game/Contracts/Characters/Aggrobot/Contract_Aggrobot_DataAssetV2.Contract_Aggrobot_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Aggrobot_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/BountyHunter/Contract_BountyHunter_DataAssetV2.Contract_BountyHunter_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_BountyHunter_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Mage/Contract_Mage_DataAssetV2.Contract_Mage_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Mage_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Cashew/Contract_Cashew_DataAssetV2.Contract_Cashew_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Cashew_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Deadeye/Contract_Deadeye_DataAssetV2.Contract_Deadeye_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Deadeye_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Cable/Contract_Cable_DataAssetV2.Contract_Cable_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Cable_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Smonk/Contract_Smonk_DataAssetV2.Contract_Smonk_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Smonk_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Rift/Contract_Rift_DataAssetV2.Contract_Rift_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Rift_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Nox/Contract_Nox_DataAssetV2.Contract_Nox_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Nox_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Pine/Contract_Pine_DataAssetV2.Contract_Pine_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Pine_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Sequoia/Contract_Sequoia_DataAssetV2.Contract_Sequoia_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Sequoia_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Sprinter/Contract_Sprinter_DataAssetV2.Contract_Sprinter_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Sprinter_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Terra/Contract_Terra_DataAssetV2.Contract_Terra_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Terra_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Events/2022Champions_EventPass/Contract_Event_Champions_EventPass_DataAssetV2.Contract_Event_Champions_EventPass_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Event_Champions_EventPass_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Events/2022LNY_Event_Pass/Contract_Event_2022LNY_DataAssetV2.Contract_Event_2022LNY_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Event_2022LNY_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Events/2023Champions_EventPass/Contract_Event_Champions2023_EventPass_DataAssetV2.Contract_Event_Champions2023_EventPass_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Event_Champions2023_EventPass_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Events/2023Horizons_EventPass/Contract_2023Horizons_DataAssetV2.Contract_2023Horizons_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_2023Horizons_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Events/2024_EOY_EventPass/Contract_Event_EOY24_DataAssetV2.Contract_Event_EOY24_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Event_EOY24_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Events/2024LNY_Event_Pass/Contract_Event_2024LNY_DataAssetV2.Contract_Event_2024LNY_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Event_2024LNY_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Events/2024Supernova_EventPass/Contract_Event_Supernova_DataAssetV2.Contract_Event_Supernova_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Event_Supernova_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Events/2025Champs_EventPass/Contract_Event_Champs2025_DataAssetV2.Contract_Event_Champs2025_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Event_Champs2025_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Events/2025LNY_Event_Pass/Contract_Event_2025LNY_DataAssetV2.Contract_Event_2025LNY_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Event_2025LNY_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Events/2026LNY_EventPass/Contract_Event_2026LNY_DataAssetV2.Contract_Event_2026LNY_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Event_2026LNY_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Killjoy/Contract_Killjoy_DataAssetV2.Contract_Killjoy_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Killjoy_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Vampire/Contract_Vampire_DataAssetV2.Contract_Vampire_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Vampire_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Breach/Contract_Breach_DataAssetV2.Contract_Breach_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Breach_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Guide/Contract_Guide_DataAssetV2.Contract_Guide_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Guide_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Contract_CB_DataAssetV2.Contract_CB_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_CB_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode1/Act1/Contract_Episode1_Act1_DataAssetV2.Contract_Episode1_Act1_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode1_Act1_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Clay/Contract_Clay_DataAssetV2.Contract_Clay_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Clay_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode1/Act2/Contract_Episode1_Act2_DataAssetV2.Contract_Episode1_Act2_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode1_Act2_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode2/Contract_Episode2_Act2_DataAssetV2.Contract_Episode2_Act2_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode2_Act2_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Hunter/Contract_Hunter_DataAssetV2.Contract_Hunter_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Hunter_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Gumshoe/Contract_Gumshoe_DataAssetV2.Contract_Gumshoe_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Gumshoe_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Grenadier/Contract_Grenadier_DataAssetV2.Contract_Grenadier_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Grenadier_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Sarge/Contract_Sarge_DataAssetV2.Contract_Sarge_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Sarge_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Phoenix/Contract_Phoenix_DataAssetV2.Contract_Phoenix_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Phoenix_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Thorne/Contract_Thorne_DataAssetV2.Contract_Thorne_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Thorne_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Pandemic/Contract_Pandemic_DataAssetV2.Contract_Pandemic_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Pandemic_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Yoru/Contract_Yoru_DataAssetV2.Contract_Yoru_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Yoru_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Wraith/Contract_Wraith_DataAssetV2.Contract_Wraith_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Wraith_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Characters/Wushu/Contract_Wushu_DataAssetV2.Contract_Wushu_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Wushu_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Events/2025EOY_EventPass/Contract_Event_2025EOY_DataAssetV2.Contract_Event_2025EOY_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Event_2025EOY_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/V26/Contract_V26_Act1_DataAssetV2.Contract_V26_Act1_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_V26_Act1_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/V25/Contract_V25_Act5_DataAssetV2.Contract_V25_Act5_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_V25_Act5_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/V25/Contract_V25_Act6_DataAssetV2.Contract_V25_Act6_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_V25_Act6_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Events/EP5_Act1_Mirrorverse_Event_Pass/Contract_Event_EP5_Act1_Mirrorverse_DataAssetV2.Contract_Event_EP5_Act1_Mirrorverse_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Event_EP5_Act1_Mirrorverse_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Events/Ep5_Act3_Recall_EventPass/Contract_Event_Recall_EventPass_DataAssetV2.Contract_Event_Recall_EventPass_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Event_Recall_EventPass_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Events/Val5_EventPass/Contract_Event_Val5_DataAssetV2.Contract_Event_Val5_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Event_Val5_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/NPE/Contract_WelcomeToAres_DataAssetV2.Contract_WelcomeToAres_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_WelcomeToAres_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Events/XP1_Event_Pass/XP1_Event_Contract_DataAssetV2.XP1_Event_Contract_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UXP1_Event_Contract_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode4/Contract_Episode4_Act2_DataAssetV2.Contract_Episode4_Act2_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode4_Act2_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode3/Contract_Episode3_Act3_DataAssetV2.Contract_Episode3_Act3_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode3_Act3_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode3/Contract_Episode3_Act2_DataAssetV2.Contract_Episode3_Act2_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode3_Act2_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode5/Contract_Episode5_Act2_DataAssetV2.Contract_Episode5_Act2_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode5_Act2_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode5/Contract_Episode5_Act1_DataAssetV2.Contract_Episode5_Act1_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode5_Act1_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode4/Contract_Episode4_Act3_DataAssetV2.Contract_Episode4_Act3_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode4_Act3_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode5/Contract_Episode5_Act3_DataAssetV2.Contract_Episode5_Act3_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode5_Act3_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode7/Contract_Episode7_Act1_DataAssetV2.Contract_Episode7_Act1_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode7_Act1_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode6/Contract_Episode6_Act3_DataAssetV2.Contract_Episode6_Act3_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode6_Act3_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode6/Contract_Episode6_Act1_DataAssetV2.Contract_Episode6_Act1_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode6_Act1_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode6/Contract_Episode6_Act2_DataAssetV2.Contract_Episode6_Act2_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode6_Act2_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode7/Contract_Episode7_Act3_DataAssetV2.Contract_Episode7_Act3_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode7_Act3_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode8/Contract_Episode8_Act1_DataAssetV2.Contract_Episode8_Act1_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode8_Act1_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode7/Contract_Episode7_Act2_DataAssetV2.Contract_Episode7_Act2_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode7_Act2_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode8/Contract_Episode8_Act2_DataAssetV2.Contract_Episode8_Act2_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode8_Act2_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode9/Contract_Episode9_Act3_DataAssetV2.Contract_Episode9_Act3_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode9_Act3_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode9/Contract_Episode9_Act1_DataAssetV2.Contract_Episode9_Act1_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode9_Act1_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode8/Contract_Episode8_Act3_DataAssetV2.Contract_Episode8_Act3_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode8_Act3_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode9/Contract_Episode9_Act2_DataAssetV2.Contract_Episode9_Act2_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode9_Act2_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/V25/Contract_V25_Act4_DataAssetV2.Contract_V25_Act4_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_V25_Act4_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/V25/Contract_V25_Act3_DataAssetV2.Contract_V25_Act3_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_V25_Act3_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/V25/Contract_V25_Act1_DataAssetV2.Contract_V25_Act1_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_V25_Act1_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/V25/Contract_V25_Act2_DataAssetV2.Contract_V25_Act2_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_V25_Act2_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Events/Val_Birthday2021_Event_Pass/Contract_Event_Val_Birthday2021_DataAssetV2.Contract_Event_Val_Birthday2021_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Event_Val_Birthday2021_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode2/Contract_Episode2_Act1_DataAssetV2.Contract_Episode2_Act1_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode2_Act1_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode1/Act3/Contract_Episode1_Act3_DataAssetV2.Contract_Episode1_Act3_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode1_Act3_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode2/Contract_Episode2_Act3_DataAssetV2.Contract_Episode2_Act3_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode2_Act3_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode3/Contract_Episode3_Act1_DataAssetV2.Contract_Episode3_Act1_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode3_Act1_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

/// Class /Game/Contracts/Story/Episode4/Contract_Episode4_Act1_DataAssetV2.Contract_Episode4_Act1_DataAssetV2_C
/// Size: 0x00D8 (216 bytes) (0x0000D8 - 0x0000D8) align 8 MaxSize: 0x00D8
class UContract_Episode4_Act1_DataAssetV2_C : public UContractDataAssetV2
{ 
public:
};

#pragma pack(pop)


static_assert(sizeof(UContract_Aggrobot_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_BountyHunter_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Mage_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Cashew_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Deadeye_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Cable_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Smonk_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Rift_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Nox_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Pine_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Sequoia_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Sprinter_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Terra_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Event_Champions_EventPass_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Event_2022LNY_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Event_Champions2023_EventPass_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_2023Horizons_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Event_EOY24_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Event_2024LNY_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Event_Supernova_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Event_Champs2025_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Event_2025LNY_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Event_2026LNY_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Killjoy_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Vampire_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Breach_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Guide_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_CB_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode1_Act1_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Clay_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode1_Act2_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode2_Act2_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Hunter_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Gumshoe_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Grenadier_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Sarge_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Phoenix_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Thorne_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Pandemic_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Yoru_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Wraith_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Wushu_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Event_2025EOY_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_V26_Act1_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_V25_Act5_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_V25_Act6_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Event_EP5_Act1_Mirrorverse_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Event_Recall_EventPass_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Event_Val5_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_WelcomeToAres_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UXP1_Event_Contract_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode4_Act2_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode3_Act3_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode3_Act2_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode5_Act2_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode5_Act1_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode4_Act3_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode5_Act3_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode7_Act1_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode6_Act3_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode6_Act1_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode6_Act2_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode7_Act3_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode8_Act1_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode7_Act2_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode8_Act2_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode9_Act3_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode9_Act1_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode8_Act3_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode9_Act2_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_V25_Act4_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_V25_Act3_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_V25_Act1_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_V25_Act2_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Event_Val_Birthday2021_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode2_Act1_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode1_Act3_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode2_Act3_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode3_Act1_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
static_assert(sizeof(UContract_Episode4_Act1_DataAssetV2_C) == 0x00D8); // 216 bytes (0x0000D8 - 0x0000D8)
