
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: ShooterGame

#pragma pack(push, 0x1)

/// Class /Game/ContentTiers/Premium_PrimaryAsset.Premium_PrimaryAsset_C
/// Size: 0x0090 (144 bytes) (0x000090 - 0x000090) align 8 MaxSize: 0x0090
class UPremium_PrimaryAsset_C : public UContentTierDataAsset
{ 
public:
};

/// Class /Game/ContentTiers/Exclusive_PrimaryAsset.Exclusive_PrimaryAsset_C
/// Size: 0x0090 (144 bytes) (0x000090 - 0x000090) align 8 MaxSize: 0x0090
class UExclusive_PrimaryAsset_C : public UContentTierDataAsset
{ 
public:
};

/// Class /Game/ContentTiers/Deluxe_PrimaryAsset.Deluxe_PrimaryAsset_C
/// Size: 0x0090 (144 bytes) (0x000090 - 0x000090) align 8 MaxSize: 0x0090
class UDeluxe_PrimaryAsset_C : public UContentTierDataAsset
{ 
public:
};

/// Class /Game/ContentTiers/Ultra_PrimaryAsset.Ultra_PrimaryAsset_C
/// Size: 0x0090 (144 bytes) (0x000090 - 0x000090) align 8 MaxSize: 0x0090
class UUltra_PrimaryAsset_C : public UContentTierDataAsset
{ 
public:
};

/// Class /Game/ContentTiers/Select_PrimaryAsset.Select_PrimaryAsset_C
/// Size: 0x0090 (144 bytes) (0x000090 - 0x000090) align 8 MaxSize: 0x0090
class USelect_PrimaryAsset_C : public UContentTierDataAsset
{ 
public:
};

#pragma pack(pop)


static_assert(sizeof(UPremium_PrimaryAsset_C) == 0x0090); // 144 bytes (0x000090 - 0x000090)
static_assert(sizeof(UExclusive_PrimaryAsset_C) == 0x0090); // 144 bytes (0x000090 - 0x000090)
static_assert(sizeof(UDeluxe_PrimaryAsset_C) == 0x0090); // 144 bytes (0x000090 - 0x000090)
static_assert(sizeof(UUltra_PrimaryAsset_C) == 0x0090); // 144 bytes (0x000090 - 0x000090)
static_assert(sizeof(USelect_PrimaryAsset_C) == 0x0090); // 144 bytes (0x000090 - 0x000090)
