
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: ShooterGame

#pragma pack(push, 0x1)

/// Class /Game/Events/2023Champions_EventPass/Event_Champions2023_DataAssetV2.Event_Champions2023_DataAssetV2_C
/// Size: 0x00C0 (192 bytes) (0x0000C0 - 0x0000C0) align 8 MaxSize: 0x00C0
class UEvent_Champions2023_DataAssetV2_C : public UEventDataAsset
{ 
public:
};

/// Class /Game/Events/2022Recall_EventPass/Event_Recall_DataAsset.Event_Recall_DataAsset_C
/// Size: 0x00C0 (192 bytes) (0x0000C0 - 0x0000C0) align 8 MaxSize: 0x00C0
class UEvent_Recall_DataAsset_C : public UEventDataAsset
{ 
public:
};

/// Class /Game/Events/2022LNY_Event_Pass/Event_2022LNY_DataAssetV2.Event_2022LNY_DataAssetV2_C
/// Size: 0x00C0 (192 bytes) (0x0000C0 - 0x0000C0) align 8 MaxSize: 0x00C0
class UEvent_2022LNY_DataAssetV2_C : public UEventDataAsset
{ 
public:
};

/// Class /Game/Events/2022Champions_EventPass/Event_Champions_DataAssetV2.Event_Champions_DataAssetV2_C
/// Size: 0x00C0 (192 bytes) (0x0000C0 - 0x0000C0) align 8 MaxSize: 0x00C0
class UEvent_Champions_DataAssetV2_C : public UEventDataAsset
{ 
public:
};

/// Class /Game/Events/2023HorizonsEventPass/Event_2023Horizons_DataAssetV2.Event_2023Horizons_DataAssetV2_C
/// Size: 0x00C0 (192 bytes) (0x0000C0 - 0x0000C0) align 8 MaxSize: 0x00C0
class UEvent_2023Horizons_DataAssetV2_C : public UEventDataAsset
{ 
public:
};

/// Class /Game/Events/2024_EOY_EventPass/Event_EOY24_DataAssetV2.Event_EOY24_DataAssetV2_C
/// Size: 0x00C0 (192 bytes) (0x0000C0 - 0x0000C0) align 8 MaxSize: 0x00C0
class UEvent_EOY24_DataAssetV2_C : public UEventDataAsset
{ 
public:
};

/// Class /Game/Events/2024LNY_Event_Pass/Event_2024LNY_DataAssetV2.Event_2024LNY_DataAssetV2_C
/// Size: 0x00C0 (192 bytes) (0x0000C0 - 0x0000C0) align 8 MaxSize: 0x00C0
class UEvent_2024LNY_DataAssetV2_C : public UEventDataAsset
{ 
public:
};

/// Class /Game/Events/2024Supernova_EventPass/Event_Supernova_DataAssetV2.Event_Supernova_DataAssetV2_C
/// Size: 0x00C0 (192 bytes) (0x0000C0 - 0x0000C0) align 8 MaxSize: 0x00C0
class UEvent_Supernova_DataAssetV2_C : public UEventDataAsset
{ 
public:
};

/// Class /Game/Events/2025Champs_EventPass/Event_Champs2025_DataAssetV2.Event_Champs2025_DataAssetV2_C
/// Size: 0x00C0 (192 bytes) (0x0000C0 - 0x0000C0) align 8 MaxSize: 0x00C0
class UEvent_Champs2025_DataAssetV2_C : public UEventDataAsset
{ 
public:
};

/// Class /Game/Events/2026LNY_EventPass/Event_2026LNY_DataAssetV2.Event_2026LNY_DataAssetV2_C
/// Size: 0x00C0 (192 bytes) (0x0000C0 - 0x0000C0) align 8 MaxSize: 0x00C0
class UEvent_2026LNY_DataAssetV2_C : public UEventDataAsset
{ 
public:
};

/// Class /Game/Events/2025EOY_EventPass/Event_2025EOY_DataAssetV2.Event_2025EOY_DataAssetV2_C
/// Size: 0x00C0 (192 bytes) (0x0000C0 - 0x0000C0) align 8 MaxSize: 0x00C0
class UEvent_2025EOY_DataAssetV2_C : public UEventDataAsset
{ 
public:
};

/// Class /Game/Events/XP1_Event/XP1_Event_DataAsset.XP1_Event_DataAsset_C
/// Size: 0x00C0 (192 bytes) (0x0000C0 - 0x0000C0) align 8 MaxSize: 0x00C0
class UXP1_Event_DataAsset_C : public UEventDataAsset
{ 
public:
};

/// Class /Game/Events/Val5_EventPass/Event_Val5_DataAssetV2.Event_Val5_DataAssetV2_C
/// Size: 0x00C0 (192 bytes) (0x0000C0 - 0x0000C0) align 8 MaxSize: 0x00C0
class UEvent_Val5_DataAssetV2_C : public UEventDataAsset
{ 
public:
};

/// Class /Game/Events/E5_A1_Mirrorverse_EventPass/Event_EP5_Act1_Mirrorverse_DataAssetV2.Event_EP5_Act1_Mirrorverse_DataAssetV2_C
/// Size: 0x00C0 (192 bytes) (0x0000C0 - 0x0000C0) align 8 MaxSize: 0x00C0
class UEvent_EP5_Act1_Mirrorverse_DataAssetV2_C : public UEventDataAsset
{ 
public:
};

/// Class /Game/Events/2025LNY_Event_Pass/Event_2025LNY_DataAssetV2.Event_2025LNY_DataAssetV2_C
/// Size: 0x00C0 (192 bytes) (0x0000C0 - 0x0000C0) align 8 MaxSize: 0x00C0
class UEvent_2025LNY_DataAssetV2_C : public UEventDataAsset
{ 
public:
};

/// Class /Game/Events/Val_Birthday2021_Event_Pass/Event_ValBirthday2021_DataAssetV2.Event_ValBirthday2021_DataAssetV2_C
/// Size: 0x00C0 (192 bytes) (0x0000C0 - 0x0000C0) align 8 MaxSize: 0x00C0
class UEvent_ValBirthday2021_DataAssetV2_C : public UEventDataAsset
{ 
public:
};

#pragma pack(pop)


static_assert(sizeof(UEvent_Champions2023_DataAssetV2_C) == 0x00C0); // 192 bytes (0x0000C0 - 0x0000C0)
static_assert(sizeof(UEvent_Recall_DataAsset_C) == 0x00C0); // 192 bytes (0x0000C0 - 0x0000C0)
static_assert(sizeof(UEvent_2022LNY_DataAssetV2_C) == 0x00C0); // 192 bytes (0x0000C0 - 0x0000C0)
static_assert(sizeof(UEvent_Champions_DataAssetV2_C) == 0x00C0); // 192 bytes (0x0000C0 - 0x0000C0)
static_assert(sizeof(UEvent_2023Horizons_DataAssetV2_C) == 0x00C0); // 192 bytes (0x0000C0 - 0x0000C0)
static_assert(sizeof(UEvent_EOY24_DataAssetV2_C) == 0x00C0); // 192 bytes (0x0000C0 - 0x0000C0)
static_assert(sizeof(UEvent_2024LNY_DataAssetV2_C) == 0x00C0); // 192 bytes (0x0000C0 - 0x0000C0)
static_assert(sizeof(UEvent_Supernova_DataAssetV2_C) == 0x00C0); // 192 bytes (0x0000C0 - 0x0000C0)
static_assert(sizeof(UEvent_Champs2025_DataAssetV2_C) == 0x00C0); // 192 bytes (0x0000C0 - 0x0000C0)
static_assert(sizeof(UEvent_2026LNY_DataAssetV2_C) == 0x00C0); // 192 bytes (0x0000C0 - 0x0000C0)
static_assert(sizeof(UEvent_2025EOY_DataAssetV2_C) == 0x00C0); // 192 bytes (0x0000C0 - 0x0000C0)
static_assert(sizeof(UXP1_Event_DataAsset_C) == 0x00C0); // 192 bytes (0x0000C0 - 0x0000C0)
static_assert(sizeof(UEvent_Val5_DataAssetV2_C) == 0x00C0); // 192 bytes (0x0000C0 - 0x0000C0)
static_assert(sizeof(UEvent_EP5_Act1_Mirrorverse_DataAssetV2_C) == 0x00C0); // 192 bytes (0x0000C0 - 0x0000C0)
static_assert(sizeof(UEvent_2025LNY_DataAssetV2_C) == 0x00C0); // 192 bytes (0x0000C0 - 0x0000C0)
static_assert(sizeof(UEvent_ValBirthday2021_DataAssetV2_C) == 0x00C0); // 192 bytes (0x0000C0 - 0x0000C0)
