
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: GameplayTags

#pragma pack(push, 0x1)

/// Struct /Game/GameplayMessageSystem/S_GameplayMessage_Channel.S_GameplayMessage_Channel
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 MaxSize: 0x000C
struct FS_GameplayMessage_Channel
{ 
	FGameplayTag                                       Channel_5_09EAC8F1408683C0B00245832BBE43FF;                 // 0x0000   (0x000C)  
};

/// Struct /Game/GameplayMessageSystem/S_GameplayMessage_Descriptor.S_GameplayMessage_Descriptor
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 MaxSize: 0x000C
struct FS_GameplayMessage_Descriptor
{ 
	FGameplayTag                                       Descriptor_5_09EAC8F1408683C0B00245832BBE43FF;              // 0x0000   (0x000C)  
};

/// Struct /Game/GameplayMessageSystem/S_GameplayMessage_Magnitude.S_GameplayMessage_Magnitude
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 MaxSize: 0x000C
struct FS_GameplayMessage_Magnitude
{ 
	FGameplayTag                                       Magnitude_11_09EAC8F1408683C0B00245832BBE43FF;              // 0x0000   (0x000C)  
};

#pragma pack(pop)


static_assert(sizeof(FS_GameplayMessage_Channel) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(FS_GameplayMessage_Descriptor) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(FS_GameplayMessage_Magnitude) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(offsetof(FS_GameplayMessage_Channel, Channel_5_09EAC8F1408683C0B00245832BBE43FF) == 0x0000);
static_assert(offsetof(FS_GameplayMessage_Descriptor, Descriptor_5_09EAC8F1408683C0B00245832BBE43FF) == 0x0000);
static_assert(offsetof(FS_GameplayMessage_Magnitude, Magnitude_11_09EAC8F1408683C0B00245832BBE43FF) == 0x0000);
