
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: ShooterGame

#pragma pack(push, 0x1)

/// Class /Game/Seasons/Season_Episode1_Act1_DataAsset.Season_Episode1_Act1_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode1_Act1_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_CB_DataAsset.Season_CB_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_CB_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode2_Act1_DataAsset.Season_Episode2_Act1_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode2_Act1_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode1_Act3_DataAsset.Season_Episode1_Act3_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode1_Act3_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode1_DataAsset.Season_Episode1_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode1_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode1_Act2_DataAsset.Season_Episode1_Act2_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode1_Act2_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode2_Act3_DataAsset.Season_Episode2_Act3_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode2_Act3_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode2_DataAsset.Season_Episode2_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode2_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode2_Act2_DataAsset.Season_Episode2_Act2_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode2_Act2_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode3_Act1_DataAsset.Season_Episode3_Act1_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode3_Act1_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode3_Act3_DataAsset.Season_Episode3_Act3_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode3_Act3_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode3_Act2_DataAsset.Season_Episode3_Act2_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode3_Act2_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode4_DataAsset.Season_Episode4_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode4_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode4_Act2_DataAsset.Season_Episode4_Act2_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode4_Act2_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode4_Act3_DataAsset.Season_Episode4_Act3_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode4_Act3_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode3_DataAsset.Season_Episode3_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode3_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode4_Act1_DataAsset.Season_Episode4_Act1_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode4_Act1_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode5_Act1_DataAsset.Season_Episode5_Act1_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode5_Act1_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode5_Act2_DataAsset.Season_Episode5_Act2_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode5_Act2_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode5_Act3_DataAsset.Season_Episode5_Act3_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode5_Act3_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode5_DataAsset.Season_Episode5_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode5_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode6_Act1_DataAsset.Season_Episode6_Act1_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode6_Act1_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode6_Act2_DataAsset.Season_Episode6_Act2_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode6_Act2_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode6_Act3_DataAsset.Season_Episode6_Act3_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode6_Act3_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode6_DataAsset.Season_Episode6_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode6_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode7_Act1_DataAsset.Season_Episode7_Act1_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode7_Act1_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode7_Act2_DataAsset.Season_Episode7_Act2_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode7_Act2_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode7_Act3_DataAsset.Season_Episode7_Act3_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode7_Act3_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode7_DataAsset.Season_Episode7_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode7_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode8_Act1_DataAsset.Season_Episode8_Act1_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode8_Act1_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode8_Act2_DataAsset.Season_Episode8_Act2_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode8_Act2_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode8_Act3_DataAsset.Season_Episode8_Act3_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode8_Act3_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode8_DataAsset.Season_Episode8_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode8_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode9_Act1_DataAsset.Season_Episode9_Act1_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode9_Act1_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode9_Act2_DataAsset.Season_Episode9_Act2_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode9_Act2_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode9_Act3_DataAsset.Season_Episode9_Act3_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode9_Act3_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_Episode9_DataAsset.Season_Episode9_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_Episode9_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_EpisodeV25-1_Act1_DataAsset.Season_EpisodeV25-1_Act1_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_EpisodeV25_1_Act1_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_EpisodeV25-1_Act2_DataAsset.Season_EpisodeV25-1_Act2_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_EpisodeV25_1_Act2_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_EpisodeV25-1_Act3_DataAsset.Season_EpisodeV25-1_Act3_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_EpisodeV25_1_Act3_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_EpisodeV25-1_DataAsset.Season_EpisodeV25-1_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_EpisodeV25_1_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_EpisodeV25-2_Act4_DataAsset.Season_EpisodeV25-2_Act4_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_EpisodeV25_2_Act4_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_EpisodeV25-2_DataAsset.Season_EpisodeV25-2_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_EpisodeV25_2_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_EpisodeV26-1_Act1_DataAsset.Season_EpisodeV26-1_Act1_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_EpisodeV26_1_Act1_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_EpisodeV25-2_Act5_DataAsset.Season_EpisodeV25-2_Act5_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_EpisodeV25_2_Act5_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_EpisodeV25-2_Act6_DataAsset.Season_EpisodeV25-2_Act6_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_EpisodeV25_2_Act6_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_EpisodeV26-1_Act2_DataAsset.Season_EpisodeV26-1_Act2_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_EpisodeV26_1_Act2_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_EpisodeV26-1_Act3_DataAsset1.Season_EpisodeV26-1_Act3_DataAsset1_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_EpisodeV26_1_Act3_DataAsset1_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_EpisodeV26-2_Act5_DataAsset.Season_EpisodeV26-2_Act5_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_EpisodeV26_2_Act5_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_EpisodeV26-2_Act4_DataAsset.Season_EpisodeV26-2_Act4_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_EpisodeV26_2_Act4_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_EpisodeV26-2_Act6_DataAsset.Season_EpisodeV26-2_Act6_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_EpisodeV26_2_Act6_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_EpisodeV26-1_DataAsset.Season_EpisodeV26-1_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_EpisodeV26_1_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Season_EpisodeV26-2_DataAsset.Season_EpisodeV26-2_DataAsset_C
/// Size: 0x00C8 (200 bytes) (0x0000C8 - 0x0000C8) align 8 MaxSize: 0x00C8
class USeason_EpisodeV26_2_DataAsset_C : public USeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_EpisodeV26-2_DataAsset.CompetitiveSeason_EpisodeV26-2_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_EpisodeV26_2_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_EpisodeV25-2_DataAsset.CompetitiveSeason_EpisodeV25-2_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_EpisodeV25_2_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_EpisodeV26-1_DataAsset.CompetitiveSeason_EpisodeV26-1_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_EpisodeV26_1_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_EpisodeV26-2_Act5_DataAsset.CompetitiveSeason_EpisodeV26-2_Act5_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_EpisodeV26_2_Act5_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_EpisodeV26-1_Act3_DataAsset.CompetitiveSeason_EpisodeV26-1_Act3_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_EpisodeV26_1_Act3_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_EpisodeV26-2_Act6_DataAsset.CompetitiveSeason_EpisodeV26-2_Act6_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_EpisodeV26_2_Act6_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_EpisodeV26-2_Act4_DataAsset.CompetitiveSeason_EpisodeV26-2_Act4_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_EpisodeV26_2_Act4_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_EpisodeV26-1_Act1_DataAsset.CompetitiveSeason_EpisodeV26-1_Act1_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_EpisodeV26_1_Act1_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_EpisodeV26-1_Act2_DataAsset.CompetitiveSeason_EpisodeV26-1_Act2_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_EpisodeV26_1_Act2_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode1_Act2_DataAsset.CompetitiveSeason_Episode1_Act2_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode1_Act2_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode1_Act1_DataAsset.CompetitiveSeason_Episode1_Act1_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode1_Act1_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_CB_DataAsset.CompetitiveSeason_CB_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_CB_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode1_DataAsset.CompetitiveSeason_Episode1_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode1_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode1_Act3_DataAsset.CompetitiveSeason_Episode1_Act3_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode1_Act3_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode2_Act1_DataAsset.CompetitiveSeason_Episode2_Act1_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode2_Act1_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode2_DataAsset.CompetitiveSeason_Episode2_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode2_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode3_Act1_DataAsset.CompetitiveSeason_Episode3_Act1_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode3_Act1_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode2_Act2_DataAsset.CompetitiveSeason_Episode2_Act2_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode2_Act2_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode2_Act3_DataAsset.CompetitiveSeason_Episode2_Act3_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode2_Act3_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode3_Act2_DataAsset.CompetitiveSeason_Episode3_Act2_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode3_Act2_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode3_Act3_DataAsset.CompetitiveSeason_Episode3_Act3_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode3_Act3_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode3_DataAsset.CompetitiveSeason_Episode3_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode3_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode4_DataAsset.CompetitiveSeason_Episode4_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode4_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode4_Act1_DataAsseT.CompetitiveSeason_Episode4_Act1_DataAsseT_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode4_Act1_DataAsseT_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode4_Act3_DataAsset.CompetitiveSeason_Episode4_Act3_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode4_Act3_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode4_Act2_DataAsset.CompetitiveSeason_Episode4_Act2_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode4_Act2_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode5_Act2_DataAsset.CompetitiveSeason_Episode5_Act2_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode5_Act2_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode5_Act1_DataAsset.CompetitiveSeason_Episode5_Act1_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode5_Act1_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode5_DataAsset.CompetitiveSeason_Episode5_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode5_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode5_Act3_DataAsset.CompetitiveSeason_Episode5_Act3_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode5_Act3_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode6_Act2_DataAsset.CompetitiveSeason_Episode6_Act2_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode6_Act2_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode6_Act1_DataAsset.CompetitiveSeason_Episode6_Act1_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode6_Act1_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode6_DataAsset.CompetitiveSeason_Episode6_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode6_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode6_Act3_DataAsset.CompetitiveSeason_Episode6_Act3_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode6_Act3_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode7_Act1_DataAsset.CompetitiveSeason_Episode7_Act1_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode7_Act1_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode7_DataAsset.CompetitiveSeason_Episode7_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode7_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode9_Act2_DataAsset.CompetitiveSeason_Episode9_Act2_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode9_Act2_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode9_Act1_DataAsset.CompetitiveSeason_Episode9_Act1_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode9_Act1_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode8_DataAsset.CompetitiveSeason_Episode8_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode8_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_EpisodeV25-1_Act1_DataAsset.CompetitiveSeason_EpisodeV25-1_Act1_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_EpisodeV25_1_Act1_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode9_Act3_DataAsset.CompetitiveSeason_Episode9_Act3_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode9_Act3_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_EpisodeV25-1_Act3_DataAsset.CompetitiveSeason_EpisodeV25-1_Act3_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_EpisodeV25_1_Act3_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_EpisodeV25-1_Act2_DataAsset.CompetitiveSeason_EpisodeV25-1_Act2_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_EpisodeV25_1_Act2_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode9_DataAsset.CompetitiveSeason_Episode9_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode9_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_EpisodeV25-2_Act5_DataAsset.CompetitiveSeason_EpisodeV25-2_Act5_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_EpisodeV25_2_Act5_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_EpisodeV25-1_DataAsset.CompetitiveSeason_EpisodeV25-1_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_EpisodeV25_1_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_EpisodeV25-2_Act6_DataAsset.CompetitiveSeason_EpisodeV25-2_Act6_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_EpisodeV25_2_Act6_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_EpisodeV25-2_Act4_DataAsset.CompetitiveSeason_EpisodeV25-2_Act4_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_EpisodeV25_2_Act4_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode8_Act2_DataAsset.CompetitiveSeason_Episode8_Act2_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode8_Act2_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode8_Act1_DataAsset.CompetitiveSeason_Episode8_Act1_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode8_Act1_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode7_Act3_DataAsset.CompetitiveSeason_Episode7_Act3_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode7_Act3_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode7_Act2_DataAsset.CompetitiveSeason_Episode7_Act2_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode7_Act2_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Competitive/CompetitiveSeason_Episode8_Act3_DataAsset.CompetitiveSeason_Episode8_Act3_DataAsset_C
/// Size: 0x0230 (560 bytes) (0x000230 - 0x000230) align 8 MaxSize: 0x0230
class UCompetitiveSeason_Episode8_Act3_DataAsset_C : public UCompetitiveSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Tournaments/PremierSeason_CN.PremierSeason_CN_C
/// Size: 0x0110 (272 bytes) (0x000110 - 0x000110) align 8 MaxSize: 0x0110
class UPremierSeason_CN_C : public UPremierSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Tournaments/PremierSeason_V26A1.PremierSeason_V26A1_C
/// Size: 0x0110 (272 bytes) (0x000110 - 0x000110) align 8 MaxSize: 0x0110
class UPremierSeason_V26A1_C : public UPremierSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Tournaments/PremierSeason_V25A6.PremierSeason_V25A6_C
/// Size: 0x0110 (272 bytes) (0x000110 - 0x000110) align 8 MaxSize: 0x0110
class UPremierSeason_V25A6_C : public UPremierSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Tournaments/PremierSeason_V25A5.PremierSeason_V25A5_C
/// Size: 0x0110 (272 bytes) (0x000110 - 0x000110) align 8 MaxSize: 0x0110
class UPremierSeason_V25A5_C : public UPremierSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Tournaments/PremierSeason_Ep7Act2_Stage1.PremierSeason_Ep7Act2_Stage1_C
/// Size: 0x0110 (272 bytes) (0x000110 - 0x000110) align 8 MaxSize: 0x0110
class UPremierSeason_Ep7Act2_Stage1_C : public UPremierSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Tournaments/PremierSeason_Ep8Act1.PremierSeason_Ep8Act1_C
/// Size: 0x0110 (272 bytes) (0x000110 - 0x000110) align 8 MaxSize: 0x0110
class UPremierSeason_Ep8Act1_C : public UPremierSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Tournaments/PremierSeason_Ep7Act3_Stage2.PremierSeason_Ep7Act3_Stage2_C
/// Size: 0x0110 (272 bytes) (0x000110 - 0x000110) align 8 MaxSize: 0x0110
class UPremierSeason_Ep7Act3_Stage2_C : public UPremierSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Tournaments/PremierSeason_Ep8Act2.PremierSeason_Ep8Act2_C
/// Size: 0x0110 (272 bytes) (0x000110 - 0x000110) align 8 MaxSize: 0x0110
class UPremierSeason_Ep8Act2_C : public UPremierSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Tournaments/PremierSeason_Ep8Act3.PremierSeason_Ep8Act3_C
/// Size: 0x0110 (272 bytes) (0x000110 - 0x000110) align 8 MaxSize: 0x0110
class UPremierSeason_Ep8Act3_C : public UPremierSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Tournaments/PremierSeason_Ep9Act1.PremierSeason_Ep9Act1_C
/// Size: 0x0110 (272 bytes) (0x000110 - 0x000110) align 8 MaxSize: 0x0110
class UPremierSeason_Ep9Act1_C : public UPremierSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Tournaments/PremierSeason_Ep9Act2.PremierSeason_Ep9Act2_C
/// Size: 0x0110 (272 bytes) (0x000110 - 0x000110) align 8 MaxSize: 0x0110
class UPremierSeason_Ep9Act2_C : public UPremierSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Tournaments/PremierSeason_Ep9Act3.PremierSeason_Ep9Act3_C
/// Size: 0x0110 (272 bytes) (0x000110 - 0x000110) align 8 MaxSize: 0x0110
class UPremierSeason_Ep9Act3_C : public UPremierSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Tournaments/PremierSeason_V25A1.PremierSeason_V25A1_C
/// Size: 0x0110 (272 bytes) (0x000110 - 0x000110) align 8 MaxSize: 0x0110
class UPremierSeason_V25A1_C : public UPremierSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Tournaments/PremierSeason_V25A2.PremierSeason_V25A2_C
/// Size: 0x0110 (272 bytes) (0x000110 - 0x000110) align 8 MaxSize: 0x0110
class UPremierSeason_V25A2_C : public UPremierSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Tournaments/PremierSeason_V25A3.PremierSeason_V25A3_C
/// Size: 0x0110 (272 bytes) (0x000110 - 0x000110) align 8 MaxSize: 0x0110
class UPremierSeason_V25A3_C : public UPremierSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Tournaments/PremierSeason_V25A4.PremierSeason_V25A4_C
/// Size: 0x0110 (272 bytes) (0x000110 - 0x000110) align 8 MaxSize: 0x0110
class UPremierSeason_V25A4_C : public UPremierSeasonDataAsset
{ 
public:
};

/// Class /Game/Seasons/Borders/Border_Level2_DataAsset.Border_Level2_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UBorder_Level2_DataAsset_C : public UActRankBorderDataAsset
{ 
public:
};

/// Class /Game/Seasons/Borders/Border_Level1_DataAsset.Border_Level1_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UBorder_Level1_DataAsset_C : public UActRankBorderDataAsset
{ 
public:
};

/// Class /Game/Seasons/Borders/Border_Level0_DataAsset.Border_Level0_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UBorder_Level0_DataAsset_C : public UActRankBorderDataAsset
{ 
public:
};

/// Class /Game/Seasons/Borders/Border_Level4_DataAsset.Border_Level4_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UBorder_Level4_DataAsset_C : public UActRankBorderDataAsset
{ 
public:
};

/// Class /Game/Seasons/Borders/Border_Level3_DataAsset.Border_Level3_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UBorder_Level3_DataAsset_C : public UActRankBorderDataAsset
{ 
public:
};

/// Class /Game/Seasons/Borders/Border_Level5_DataAsset.Border_Level5_DataAsset_C
/// Size: 0x0080 (128 bytes) (0x000080 - 0x000080) align 8 MaxSize: 0x0080
class UBorder_Level5_DataAsset_C : public UActRankBorderDataAsset
{ 
public:
};

#pragma pack(pop)


static_assert(sizeof(USeason_Episode1_Act1_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_CB_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode2_Act1_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode1_Act3_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode1_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode1_Act2_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode2_Act3_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode2_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode2_Act2_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode3_Act1_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode3_Act3_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode3_Act2_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode4_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode4_Act2_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode4_Act3_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode3_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode4_Act1_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode5_Act1_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode5_Act2_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode5_Act3_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode5_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode6_Act1_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode6_Act2_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode6_Act3_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode6_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode7_Act1_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode7_Act2_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode7_Act3_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode7_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode8_Act1_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode8_Act2_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode8_Act3_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode8_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode9_Act1_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode9_Act2_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode9_Act3_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_Episode9_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_EpisodeV25_1_Act1_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_EpisodeV25_1_Act2_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_EpisodeV25_1_Act3_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_EpisodeV25_1_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_EpisodeV25_2_Act4_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_EpisodeV25_2_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_EpisodeV26_1_Act1_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_EpisodeV25_2_Act5_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_EpisodeV25_2_Act6_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_EpisodeV26_1_Act2_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_EpisodeV26_1_Act3_DataAsset1_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_EpisodeV26_2_Act5_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_EpisodeV26_2_Act4_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_EpisodeV26_2_Act6_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_EpisodeV26_1_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(USeason_EpisodeV26_2_DataAsset_C) == 0x00C8); // 200 bytes (0x0000C8 - 0x0000C8)
static_assert(sizeof(UCompetitiveSeason_EpisodeV26_2_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_EpisodeV25_2_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_EpisodeV26_1_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_EpisodeV26_2_Act5_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_EpisodeV26_1_Act3_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_EpisodeV26_2_Act6_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_EpisodeV26_2_Act4_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_EpisodeV26_1_Act1_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_EpisodeV26_1_Act2_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode1_Act2_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode1_Act1_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_CB_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode1_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode1_Act3_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode2_Act1_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode2_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode3_Act1_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode2_Act2_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode2_Act3_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode3_Act2_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode3_Act3_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode3_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode4_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode4_Act1_DataAsseT_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode4_Act3_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode4_Act2_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode5_Act2_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode5_Act1_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode5_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode5_Act3_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode6_Act2_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode6_Act1_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode6_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode6_Act3_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode7_Act1_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode7_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode9_Act2_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode9_Act1_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode8_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_EpisodeV25_1_Act1_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode9_Act3_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_EpisodeV25_1_Act3_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_EpisodeV25_1_Act2_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode9_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_EpisodeV25_2_Act5_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_EpisodeV25_1_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_EpisodeV25_2_Act6_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_EpisodeV25_2_Act4_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode8_Act2_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode8_Act1_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode7_Act3_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode7_Act2_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UCompetitiveSeason_Episode8_Act3_DataAsset_C) == 0x0230); // 560 bytes (0x000230 - 0x000230)
static_assert(sizeof(UPremierSeason_CN_C) == 0x0110); // 272 bytes (0x000110 - 0x000110)
static_assert(sizeof(UPremierSeason_V26A1_C) == 0x0110); // 272 bytes (0x000110 - 0x000110)
static_assert(sizeof(UPremierSeason_V25A6_C) == 0x0110); // 272 bytes (0x000110 - 0x000110)
static_assert(sizeof(UPremierSeason_V25A5_C) == 0x0110); // 272 bytes (0x000110 - 0x000110)
static_assert(sizeof(UPremierSeason_Ep7Act2_Stage1_C) == 0x0110); // 272 bytes (0x000110 - 0x000110)
static_assert(sizeof(UPremierSeason_Ep8Act1_C) == 0x0110); // 272 bytes (0x000110 - 0x000110)
static_assert(sizeof(UPremierSeason_Ep7Act3_Stage2_C) == 0x0110); // 272 bytes (0x000110 - 0x000110)
static_assert(sizeof(UPremierSeason_Ep8Act2_C) == 0x0110); // 272 bytes (0x000110 - 0x000110)
static_assert(sizeof(UPremierSeason_Ep8Act3_C) == 0x0110); // 272 bytes (0x000110 - 0x000110)
static_assert(sizeof(UPremierSeason_Ep9Act1_C) == 0x0110); // 272 bytes (0x000110 - 0x000110)
static_assert(sizeof(UPremierSeason_Ep9Act2_C) == 0x0110); // 272 bytes (0x000110 - 0x000110)
static_assert(sizeof(UPremierSeason_Ep9Act3_C) == 0x0110); // 272 bytes (0x000110 - 0x000110)
static_assert(sizeof(UPremierSeason_V25A1_C) == 0x0110); // 272 bytes (0x000110 - 0x000110)
static_assert(sizeof(UPremierSeason_V25A2_C) == 0x0110); // 272 bytes (0x000110 - 0x000110)
static_assert(sizeof(UPremierSeason_V25A3_C) == 0x0110); // 272 bytes (0x000110 - 0x000110)
static_assert(sizeof(UPremierSeason_V25A4_C) == 0x0110); // 272 bytes (0x000110 - 0x000110)
static_assert(sizeof(UBorder_Level2_DataAsset_C) == 0x0080); // 128 bytes (0x000080 - 0x000080)
static_assert(sizeof(UBorder_Level1_DataAsset_C) == 0x0080); // 128 bytes (0x000080 - 0x000080)
static_assert(sizeof(UBorder_Level0_DataAsset_C) == 0x0080); // 128 bytes (0x000080 - 0x000080)
static_assert(sizeof(UBorder_Level4_DataAsset_C) == 0x0080); // 128 bytes (0x000080 - 0x000080)
static_assert(sizeof(UBorder_Level3_DataAsset_C) == 0x0080); // 128 bytes (0x000080 - 0x000080)
static_assert(sizeof(UBorder_Level5_DataAsset_C) == 0x0080); // 128 bytes (0x000080 - 0x000080)
